nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		   }
		   else    //357.38
		   if ( Point == 3 )
		   {
			      if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39)&&(tmpinfo[4]>=0x30)&&(tmpinfo[4]<=0x39)) 
				   sp = ( tmpinfo[0] - 0x30 ) * 100 + ( tmpinfo[1] - 0x30 ) * 10 + ( tmpinfo[2] - 0x30 ) ;
				  else
				   return;
   
	       }
		   else
		   	{
               sp=0;   
		   	}
		   GPS_direction=sp;  //  单位 1度

	   //----------  拐点补传相关   ----------
	  // Inflexion_Process();
       
	   
		   
   }
   else if ( UDP_dataPacket_flag == 0x03 )
   {
          GPS_direction=0; 		  
 
   }


    return;
  }
 


}

void Date_pro(u8 *tmpinfo,u8 fDateModify, u8 hour, u8 min , u8 sec)
{
 uint8_t  year=0,mon=0,day=0;  
 TDateTime now;

 
 day = (( tmpinfo[0] - 0x30 ) * 10 ) + ( tmpinfo[1] - 0x30 );
 mon = (( tmpinfo[2] - 0x30 ) * 10 ) + ( tmpinfo[3] - 0x30 );
 year = (( tmpinfo[4] - 0x30 ) * 10 ) + ( tmpinfo[5] - 0x30 );
 
 if(fDateModify){
	 //sscanf(tmpinfo,"%2d%2d%2d",&day,&mon,&year);
	 day++;
	 if(mon == 2){
		 if ( ( year % 4 ) == 0 ){
			 if ( day == 30 ){day = 1;mon++;}
		 }else if ( day == 29 ){ day = 1;mon++;}
	 }else if (( mon == 4 ) || ( mon == 6 ) || ( mon == 9 ) || ( mon == 11 )){
		 if ( day == 31 ){mon++;day = 1;}
	 }else{
		 if ( day == 32 ){mon++;day = 1;}	 
		 if( mon == 13 ){mon = 1;year++; }
	 }
 }
 GPRMC.utc_year=year;
 GPRMC.utc_mon=mon;
 GPRMC.utc_day=day;
 if((sec==0)&&(GPRMC.status=='A')){
	 now.year = year;
	 now.month = mon;	   
	 now.day = day;
	 now.hour = hour;
	 now.min = min;
	 now.sec = sec;
	 now.week=1;      
	 Device_RTC_set(now);  
 }
 //------------------------------------------------ 	
 if(GPRMC.status=='A')     //  记录定位时间
{
  Time2BCD(A_time);  
  //------- Debug 存储 每秒的经纬度  || 实际应该是 存储每分钟的位置  -----   
  //  内容持续55秒每秒更新，这寄存器中记录的是在每分钟内最后一包定位的经纬度 ,预留5秒用于存储上一小时的位置 
  if(sec<55)
  	{
      memcpy(Posit[min].latitude_BgEnd,Gps_Gprs.Latitude,4); //北纬
      memcpy(Posit[min].longitude_BgEnd,Gps_Gprs.Longitude,4); //经度	  
      Posit[min].longitude_BgEnd[0]|=0x80;//  东经
  	}
  if((min==59)&&(sec==55))
    { // 每个小时的位置信息               
       NandsaveFlg.MintPosit_SaveFlag=1; 
	}  
 }   
  //---- 存储当前的起始里程  跨天时------------
   if((hour==0)&&(min==0)&&(sec<3))   // 存储3次确保存储成功 
  	{ 
	  JT808Conf_struct.DayStartDistance_32=JT808Conf_struct.Distance_m_u32;
          Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
       } 
 
 //-------------------------------------------------
      //---------  天地通协议  -------
                       
						//if(systemTick_TriggerGPS==0)
 {
   Temp_Gps_Gprs.Date[0] = year;
   Temp_Gps_Gprs.Date[1] = mon;
   Temp_Gps_Gprs.Date[2] = day;   						
  }

  
 //-------------- 计算算平均速度 ----------------
 AvrgSpd_MintProcess(hour,min,sec); 
}


//---------  GGA --------------------------
void HDop_pro(u8 *tmpinfo)
{ 
 float dop;
 
  dop=atof((char *)tmpinfo);				        
  HDOP_value=dop;		 //  Hdop 数值

}

void  GPS_Delta_DurPro(void)    //告GPS 触发上报处理函数
{
    

 //    1.    定时上报相关
  if(1==JT808Conf_struct.SD_MODE.DUR_TOTALMODE)   // 定时上报模式
  {
	 	//----- 上一包数据记录的时间
		fomer_time_seconds = ( u32 ) ( BakTime[0] * 60 * 60 ) + ( u32 ) ( BakTime[1] * 60 ) + ( u32 ) BakTime[2];  
		
		//-----  当前数据记录的时间
		tmp_time_secnonds = ( u32 ) ( CurrentTime[0] * 60 * 60 ) + ( u32 ) ( CurrentTime[1] * 60 ) + ( u32 )  CurrentTime[2];
		
		//一天86400秒
		
		if ( tmp_time_secnonds > fomer_time_seconds )
		{
				delta_time_seconds = tmp_time_secnonds - fomer_time_seconds;
				//systemTickGPS_Clear();
		}
		else if(tmp_time_secnonds < fomer_time_seconds)
		{
				delta_time_seconds = 86400 - fomer_time_seconds + tmp_time_secnonds;
				//systemTickGPS_Clear();
		}
		else 
		 {
			 // systemTickGPS_Set();  
			  UDP_dataPacket_flag=0X03; 
			  StatusReg_GPS_V();
		 }	
		
		if((SleepState==1)&&(delta_time_seconds==(Current_SD_Duration-5)))  //  --  休眠时 先发鉴权
		   {
			  SleepConfigFlag=1;  //发送前5 发送一包鉴权
		   }            
		
		if((delta_time_seconds >= Current_SD_Duration))//limitSend_idle
		  {			  
			 if(Current_SD_Duration<10)   // 若发送间隔小于 10  则上报即时信息 
			  {     
			        Current_State=1;   //   使能发送标志位
				     PositionSD_Enable();
                     Current_UDP_sd=1;   // 使能发送操作执行
			  }
			 else
			 	 Current_State=0; 
			 	    
			  PositionSD_Enable();
			  memcpy(BakTime,CurrentTime,3); // update   
		  }
  	}  
  
    //------------------------------ do this every  second-----------------------------------------    
	memcpy((char*)&Gps_Gprs,(char*)&Temp_Gps_Gprs,sizeof(Temp_Gps_Gprs));  






  //  2.  判断行驶状态
     if((Speed_gps>100) || (Speed_cacu>100))
     {
            VDR_TrigStatus.Run_baseon_spd_10s_couter++;
			if(VDR_TrigStatus.Run_baseon_spd_10s_couter>20)  //  速度大于10km/h  超过 10s   这里判20s
				{
				   //  做循环判断处理
				   if(VDR_TrigStatus.Run_baseon_spd_10s_couter>65530)
				   	  VDR_TrigStatus.Run_baseon_spd_10s_couter=21;

                   //    11 H   连续驾驶开始时间   和起始位置     从60s 开始算驾驶起始
                    VDR_product_11H_Start();
                    
				   
				    VDR_TrigStatus.Running_state_enable=1;  //  处于行驶状态

				}
     }
     if((Speed_gps<100)&&(Speed_cacu<100))
     {
         //         11 H     相关
         VDR_product_11H_End();
	 
		 VDR_TrigStatus.Run_baseon_spd_10s_couter=0;		 
		 VDR_TrigStatus.Running_state_enable=0;  //  处于停止状态    
	 }




	 

   // 3.  行驶记录相关数据产生 触发,  且定位的情况下   
    VDR_product_08H_09H_10H();




   
   //4.   电子围栏 判断  ----------
  /*  if((Temp_Gps_Gprs.Time[2]%20)==0) //   认证时不检测圆形电子围栏
    {
        CycleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
		//rt_kprintf("\r\n --- 判断圆形电子围栏");
    }	*/
    // if((Temp_Gps_Gprs.Time[2]==5)||(Temp_Gps_Gprs.Time[2]==25)||(Temp_Gps_Gprs.Time[2]==45)) //  
    if(Temp_Gps_Gprs.Time[2]%2==0)//    认证时要求2 秒
   {
        RectangleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
		//rt_kprintf("\r\n -----判断矩形电子围栏"); 
    }
      if((Temp_Gps_Gprs.Time[2]%5)==0) //    
    {
          // printf("\r\n --- 判断圆形电子围栏");
           RouteRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
    }
	//rt_kprintf("\r\n Delta_seconds %d \r\n",delta_time_seconds);    
  //----------------------------------------------------------------------------------------	
}

//----------------------------------------------------------------------------------------------------
void  SpeedSensorProcess(void)   // 通过汽车的速度传感器获得 速度 并计算里程
{
  u32  Distance_1s_m=0;  // 一秒钟运行 多少米
//  u32 sp=0;
  //  1. 用K值计算速度   -----------------------------------------------------------
     /*
           K 表示 每公里 脉冲数 
           1米/脉冲数 :   K/1000 
           Delta_1s_Plus: 每秒钟采集到的脉冲数    
           每秒行驶米数:  Delta_1s_Plus *1000/K
           => Delta_1s_Plus *1000/K*3.6*10 单位:0.1  km/h  =>Delta_1s_Plus *36000/K  单位:0.1 km/h
      */
    Speed_cacu=(Delta_1s_Plus*36000)/JT808Conf_struct.Vech_Character_Value;  // 通过计算得到的速度 
    GPS_speed=Speed_cacu;  //把计算得到的传感器速度给 协议 寄存器
    Distance_1s_m=(Delta_1s_Plus*1000)/JT808Conf_struct.Vech_Character_Value;  // 每秒运行多少米
  // 2. 计算里程相关  -------------------------------------------------------------
          //------------------------------------
		ModuleStatus|=Status_Pcheck;	
		 
   
		  //------- GPS  里程计算  -------- 
		  JT808Conf_struct.Distance_m_u32+=Distance_1s_m;	// 除以3600 是m/s 
		  if(JT808Conf_struct.Distance_m_u32>0xFFFFFF)
				   JT808Conf_struct.Distance_m_u32=0;	   //里程最长这么多米	   

