nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

u8  Stuff_RegisterPacket_0100H(u8  LinkNum)  
{  
  u8  i=0;
// 1. Head
  if(!Protocol_Head(MSG_0x0100,Packet_Normal)) 
 	return false; 	
    
  // 2. content 
    //  province ID
    Original_info[Original_info_Wr++]=0x00;//(u8)(JT808Conf_struct.Vechicle_Info.Dev_ProvinceID>>8);
    Original_info[Original_info_Wr++]=10;;//(u8)JT808Conf_struct.Vechicle_Info.Dev_ProvinceID;  // 天津12
    //  county  ID
    Original_info[Original_info_Wr++]=(u8)(1010>>8);
    Original_info[Original_info_Wr++]=(u8)1010;    
	//  product Name	
	//  product Name	
    memcpy(Original_info+Original_info_Wr,"70420",5);   //北京中斗  70104      70523     70218
    Original_info_Wr+=5;
	//  终端型号 20 Bytes      -- 补充协议里做更改
	memcpy(Original_info+Original_info_Wr,"TW703",5);   //ZD-V01H  HVT100BD1   CM-10A-BD  YW3000-YM/MGB
    Original_info_Wr+=5;       
    for(i=0;i<15;i++)  
	 Original_info[Original_info_Wr++]=0x00;    	  
    //  终端ID   7 Bytes    ,    
    memcpy(Original_info+Original_info_Wr,DeviceNumberID+5,7);        
    Original_info_Wr+=7;  
	//  车牌颜色  
	Original_info[Original_info_Wr++]=2; //JT808Conf_struct.Vechicle_Info.Dev_Color;
	
	if(JT808Conf_struct.Vechicle_Info.Dev_Color!=0)
	{
		//  车牌
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Num,strlen((const char*)(JT808Conf_struct.Vechicle_Info.Vech_Num)));//13);  
		Original_info_Wr+=strlen((const char*)(JT808Conf_struct.Vechicle_Info.Vech_Num));
	}
	else
	{
	       rt_kprintf("\r\n  车辆颜色:0     Need Vin\r\n");
		// 车辆VIN 
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_VIN,17);
		Original_info_Wr+=17;
    }

 
  if(DispContent)
  {      
       rt_kprintf("\r\n	SEND Reigster Packet! \r\n");  
	 rt_kprintf("\r\n  注册发送时间 %d-%d-%d %02d:%02d:%02d\r\n", time_now.year+2000, time_now.month, time_now.day, \
      time_now.hour, time_now.min, time_now.sec);
   

  }

 
 //  3. Send 
  Protocol_End(Packet_Normal,LinkNum);   
  if(DispContent)
 rt_kprintf("\r\n	SEND Reigster Packet! \r\n");  
 return true;  

}

//--------------------------------------------------------------------------------------
u8  Stuff_DeviceHeartPacket_0002H(void)      
{  
  
	// 1. Head
	if(!Protocol_Head(MSG_0x0002,Packet_Normal))  
 	  return false; 
	 // 2. content  is null
	 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Dev Heart! \r\n");    
	 return true;  

}
//--------------------------------------------------------------------------------------
u8  Stuff_DeviceDeregister_0101H(void)      
{    
	// 1. Head
	if(!Protocol_Head(MSG_0x0101,Packet_Normal)) 
 	  return false; //终端注销 
	 // 2. content  is null 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Deregister  注销! \r\n");  
	 return true;    
}
//------------------------------------------------------------------------------------
u8  Stuff_DevLogin_0102H(void)      
{    
	// 1. Head
	if(!Protocol_Head(MSG_0x0102,Packet_Normal))  
 	  return false; //终端鉴权 
	 // 2. content  
	  
	 memcpy(Original_info+Original_info_Wr,JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode));   // 鉴权码  string Type
	 Original_info_Wr+=strlen((const char*)JT808Conf_struct.ConfirmCode); 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	 发送鉴权! \r\n");   
	 return true;    
}

//--------------------------------------------------------------------------------------
u8  Stuff_Normal_Data_0200H(void)  
{
  u8 spd_sensorReg[2];
  u32  Dis_01km=0;
 //  1. Head  
   if(!Protocol_Head(MSG_0x0200,Packet_Normal)) 
 	  return false;  
 // 2. content 
 if(Api_cycle_read(Original_info+Original_info_Wr, 31)==false)            
   return false;
 Original_info_Wr+=28;   // 内容只有28 
 memcpy(spd_sensorReg,Original_info+Original_info_Wr,2);// 把读取传感器速度 
 
 
  //----------- 附加信息  ------------ 
  //  附加信息 1  -----------------------------    
  //  附加信息 ID
  Original_info[Original_info_Wr++]=0x03; // 行驶记录仪的速度
  //  附加信息长度
  Original_info[Original_info_Wr++]=2;
  //  类型
  Original_info[Original_info_Wr++]=(u8)(Speed_cacu>>8); 
  Original_info[Original_info_Wr++]=(u8)(Speed_cacu);	   
  //rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu); 
   //  附加信息 2  -----------------------------	
   //  附加信息 ID
   Original_info[Original_info_Wr++]=0x01; // 车上的行驶里程
   //  附加信息长度
   Original_info[Original_info_Wr++]=4; 
   //  类型
   Dis_01km=JT808Conf_struct.Distance_m_u32/100;
   Original_info[Original_info_Wr++]=(Dis_01km>>24); 
   Original_info[Original_info_Wr++]=(Dis_01km>>16); 
   Original_info[Original_info_Wr++]=(Dis_01km>>8); 
   Original_info[Original_info_Wr++]=Dis_01km; 
 
 
  //  附加信息 3 
  if(Warn_Status[1]&0x10)
 {
   //  附加信息 ID
   Original_info[Original_info_Wr++]=0x12; //  进出区域/路线报警
   //  附加信息长度 
   Original_info[Original_info_Wr++]=6;
   //  类型
   Original_info[Original_info_Wr++]=InOut_Object.TYPE;
   Original_info[Original_info_Wr++]=(InOut_Object.ID>>24);
   Original_info[Original_info_Wr++]=(InOut_Object.ID>>16);
   Original_info[Original_info_Wr++]=(InOut_Object.ID>>8);
   Original_info[Original_info_Wr++]=InOut_Object.ID;
   Original_info[Original_info_Wr++]=InOut_Object.InOutState;  
   rt_kprintf("\r\n ----- 0x0200 附加信息 \r\n");	 
 }
 
  //  附件信息4
  if(Warn_Status[3]&0x02)
  { 	 
	//	附加信息 ID
	Original_info[Original_info_Wr++]=0x11; //	进出区域/路线报警
	//	附加信息长度 
	Original_info[Original_info_Wr++]=1; 
	//	类型
	Original_info[Original_info_Wr++]=0; //  无特定位置   
 
  }


	   //  附加信息 5  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0xFE; //信号强度
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=2; 
	 //  类型
	 Original_info[Original_info_Wr++]= BD_EXT.FJ_SignalValue; 
	 Original_info[Original_info_Wr++]=0x00;  //  保留 

        //if(DispContent)
         //     printf("\r\n---- Satelitenum: %d , CSQ:%d\r\n",Satelite_num,ModuleSQ);  

        //  附加信息 6  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0xFF; //自定义模拟量上传
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=6; 
	 //  类型
	 Original_info[Original_info_Wr++]= BD_EXT.FJ_IO_1; 
	 Original_info[Original_info_Wr++]= BD_EXT.FJ_IO_2;  
	 Original_info[Original_info_Wr++]=(BD_EXT.AD_0>>8);  // 模拟量 1
	 Original_info[Original_info_Wr++]=BD_EXT.AD_0;
	 Original_info[Original_info_Wr++]=(BD_EXT.AD_1>>8);  // 模拟量 2
	 Original_info[Original_info_Wr++]=BD_EXT.AD_1;

 
 //  3. Send 
 Protocol_End(Packet_Normal ,0);
   	
