nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
				//Original_info[Original_info_Wr++]=0;    // Hi      666=0x29A
				//Original_info[Original_info_Wr++]=0;	   // Lo

				Original_info[Original_info_Wr++] = 0x00;                       // 保留字
			}
			//	信息内容
			WatchDog_Feed( );

			if(Vdr_Wr_Rd_Offset.V_09H_Write>0)
			 {	
			      stuff_len=stuff_drvData(0x09,Vdr_Wr_Rd_Offset.V_09H_Write-1,1,Original_info + Original_info_Wr); 
			     Original_info_Wr += stuff_len;      
			 }
			 
			break;
		case   0x10:                                                            // 10-13     10   事故疑点采集记录
			//事故疑点数据
			//if( ( PaketType == Packet_Divide ) && ( Recode_Obj.Current_pkt_num == 1 ) )
			{
				Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
				Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
				Original_info[Original_info_Wr++]	= Recode_Obj.CMD;           // 命令字
				Swr									= Original_info_Wr;

				Original_info[Original_info_Wr++]	= 0x55;                     // 起始头
				Original_info[Original_info_Wr++]	= 0x7A;

				Original_info[Original_info_Wr++] = 0x10;                       //命令字

				if(Vdr_Wr_Rd_Offset.V_10H_Write>0)
							   SregLen					= 234 ;//*100;                //0		 // 信息长度
				else
							   SregLen=0;
				Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 );     // Hi
				Original_info[Original_info_Wr++]	= (u8)SregLen;              // Lo

				Original_info[Original_info_Wr++] = 0x00;                       // 保留字
			}
			//------- 信息内容 ------
			//WatchDog_Feed( );
			delay_ms( 3 );
			
			if(Vdr_Wr_Rd_Offset.V_10H_Write>0) 
			{
			   stuff_len=stuff_drvData(0x10,Vdr_Wr_Rd_Offset.V_10H_Write-1,1,Original_info + Original_info_Wr); 
			    Original_info_Wr += stuff_len;   
			}

			break;

		case  0x11:                                                             // 11 采集指定的的超时驾驶记录
			//if( ( PaketType == Packet_Divide ) && ( Recode_Obj.Current_pkt_num == 1 ) )
			{
				Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
				Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
				Original_info[Original_info_Wr++]	= Recode_Obj.CMD;           // 命令字
				Swr									= Original_info_Wr;

				Original_info[Original_info_Wr++]	= 0x55;                     // 起始头
				Original_info[Original_info_Wr++]	= 0x7A;

				Original_info[Original_info_Wr++] = 0x11;                       //命令字

			//	SregLen								= 50 * 10;                 // 信息长度
					if(Vdr_Wr_Rd_Offset.V_11H_Write>10)
				       SregLen= 500;                      // 信息长度      50*10
				else
					   SregLen=Vdr_Wr_Rd_Offset.V_11H_Write*50;
				Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 );     // Hi
				Original_info[Original_info_Wr++]	= (u8)SregLen;              // Lo    65x7

				Original_info[Original_info_Wr++] = 0x00;                       // 保留字
			}



			/*
			       每条 50 bytes  ，100 条    获取的是每10 条打一包  500 packet    Totalnum=10
			 */
			 WatchDog_Feed( );
			//get_11h( Original_info + Original_info_Wr );                        //50  packetsize      num=100
			//Original_info_Wr += 500; 

			if(Vdr_Wr_Rd_Offset.V_11H_Write>10)
				stuff_len=stuff_drvData(0x11,Vdr_Wr_Rd_Offset.V_11H_Write-10,10,Original_info + Original_info_Wr);  
			else
				stuff_len=stuff_drvData(0x11,0,Vdr_Wr_Rd_Offset.V_11H_Write,Original_info + Original_info_Wr); 

			Original_info_Wr += stuff_len; 
			break;
			
		case  0x12:                                                             // 12 采集指定驾驶人身份记录  ---Devide
			//if( ( PaketType == Packet_Divide ) && ( Recode_Obj.Current_pkt_num == 1 ) )
			{
				Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
				Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
				Original_info[Original_info_Wr++]	= Recode_Obj.CMD;           // 命令字
				Swr									= Original_info_Wr;

				Original_info[Original_info_Wr++]	= 0x55;                     // 起始头
				Original_info[Original_info_Wr++]	= 0x7A;

				Original_info[Original_info_Wr++] = 0x12;                       //命令字

			   if(Vdr_Wr_Rd_Offset.V_12H_Write>20)
				       SregLen= 500;                      // 信息长度      50*10
				else
					   SregLen=Vdr_Wr_Rd_Offset.V_12H_Write*25; 
				Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 );     // Hi
				Original_info[Original_info_Wr++]	= (u8)SregLen;              // Lo    65x7

				Original_info[Original_info_Wr++]  = 0x00;                      // 保留字
			}
			//------- 信息内容 ------


			/*
			        驾驶员身份登录记录  每条25 bytes      200条      20条一包 500 packetsize  totalnum=10
			 */
			 WatchDog_Feed( );
			if(Vdr_Wr_Rd_Offset.V_12H_Write>20)
				stuff_len=stuff_drvData(0x12,Vdr_Wr_Rd_Offset.V_12H_Write-20,20,Original_info + Original_info_Wr);  
			else
				stuff_len=stuff_drvData(0x12,0,Vdr_Wr_Rd_Offset.V_12H_Write,Original_info + Original_info_Wr); 

			Original_info_Wr += stuff_len; 
			break;
		case  0x13:                                                     // 13 采集记录仪外部供电记录
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;       // 命令字
			Swr									= Original_info_Wr;
			Original_info[Original_info_Wr++]	= 0x55;                 // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;

			Original_info[Original_info_Wr++] = 0x13;                   //命令字

            
			//SregLen								= 700;                  // 信息长度
			if(Vdr_Wr_Rd_Offset.V_13H_Write>100)
				       SregLen= 700;                      // 信息长度      50*10
			else
					   SregLen=Vdr_Wr_Rd_Offset.V_13H_Write*7;
				
			Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 ); // Hi
			Original_info[Original_info_Wr++]	= (u8)SregLen;          // Lo    65x7

			Original_info[Original_info_Wr++] = 0x00;                   // 保留字
			//------- 信息内容 ------


			/*
			   外部供电记录   7 个字节  100 条       一个完整包
			 */
			 WatchDog_Feed( );
			//get_13h( Original_info + Original_info_Wr );
			//Original_info_Wr += 700;
			
			if(Vdr_Wr_Rd_Offset.V_13H_Write>100)
				stuff_len=stuff_drvData(0x13,Vdr_Wr_Rd_Offset.V_13H_Write-100,100,Original_info + Original_info_Wr);  
			else
				stuff_len=stuff_drvData(0x13,0,Vdr_Wr_Rd_Offset.V_13H_Write,Original_info + Original_info_Wr); 

