nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
						  	}				
						  //---------------------------------------------------------
						  soundpage=(Sound_sdState.SD_packetNum-1)/5;// 得到page 
						  sounddelta=((Sound_sdState.SD_packetNum-1)%5)*SpxGet_Size; // 得到页内偏移
		                   rt_kprintf("\r\n inadd=%d  soundpage =%d  inpageoffset=%d \r\n",inadd,soundpage,sounddelta);
						 //  i=read_file(SpxSrcName,(soundpage<<9),512,SpxBuf); 
						 //  if(i==false)
							// {
							  // rt_kprintf("\r\n spx文件: %s   读取失败--2\r\n",SpxSrcName);  
							   //return false;
							 //} 
						 Api_Config_read(voice, Sound_sdState.SD_packetNum, SpxBuf,500);   
						 memcpy(instr,SpxBuf+sounddelta,SpxGet_Size);   		
		                 //---------  spx Decode  5  包 ---------                 
						 speachDecode(instr, Original_info + Original_info_Wr); 
						 Original_info_Wr+=160;
						 speachDecode(instr+20, Original_info + Original_info_Wr);  
						 Original_info_Wr+=160; 
						 speachDecode(instr+40, Original_info + Original_info_Wr); 
						 Original_info_Wr+=160;
						 speachDecode(instr+60, Original_info + Original_info_Wr);    
						 Original_info_Wr+=160; 
						 speachDecode(instr+80, Original_info + Original_info_Wr); 
						 Original_info_Wr+=160;
				  	}
				 else
				 if(mp3_sendstate==1)
				 	{                       
						inadd=(Sound_sdState.SD_packetNum-1)<<9; //乘以512
						if(mp3_fsize>inadd)
						  {
							  if((mp3_fsize-inadd)>512)
								   readsize=512;
							  else
							   {   
								  readsize=mp3_fsize-inadd; // 最后一包	
								  rt_kprintf("\r\n	 最后一包 mp3size =%d \r\n",readsize);
							   }
						  }
						else
						   return false;
						//rt_kprintf("\r\n 读取文件\r\n");
						i=read_file(SpxSrcName,inadd,readsize,Original_info + Original_info_Wr); 
						//rt_kprintf("\r\n 读取文件完毕\r\n");
						if(i==false)
						  {
							rt_kprintf("\r\n mp3文件: %s	读取失败\r\n",SpxSrcName); 
							return false;
						  } 					 
					  Original_info_Wr+=readsize;//	
                      

				 	}
			}
              else
			  	  return false; 
       */
		          break;
		  case 2 : // 视频
                  if(TF_Card_Status()==1)
                  	{  ;
					 /*	inadd=(Video_sdState.SD_packetNum-1)<<9; //乘以512
						if(wmv_fsize>inadd)
						  {
							  if((wmv_fsize-inadd)>512)
								   readsize=512;
							  else
							   {   
								  readsize=wmv_fsize-inadd; // 最后一包	
								  rt_kprintf("\r\n	 最后一包 wmvsize =%d \r\n",readsize);
							   }
						  }
						else
						   return false;
						i=read_file(SpxSrcName,inadd,readsize,Original_info + Original_info_Wr); 
						if(i==false)
						  {
							rt_kprintf("\r\n mp3文件: %s	读取失败\r\n",SpxSrcName); 
							return false;
						  } 					 
					  Original_info_Wr+=readsize;	   
                        */
                  	}
				  else
				  	return false;


		          break;
		  default:
		  	      return false;
         }	  

	 
	 if(MediaObj.Media_currentPacketNum>MediaObj.Media_totalPacketNum)
	 {
	 	return false;
	 }	
	 //  5. Send 
	 Protocol_End(Packet_Divide,0);
	  if(DispContent)
	   rt_kprintf("\r\n	Send Media Data \r\n");     
	//  else
	  {
		 rt_kprintf("\r\n pic_total_num:  %d   current_num:  %d   \r\n ",MediaObj.Media_totalPacketNum,MediaObj.Media_currentPacketNum);
		 if(MediaObj.Media_currentPacketNum>=MediaObj.Media_totalPacketNum)
		 {				    
			rt_kprintf("\r\n Media 最后一个block\r\n");
			
			if(0==MediaObj.RSD_State)	// 如果在顺序传输模式下，则改为停止状态,等待中心下重传
			 {
			    MediaObj.RSD_State=2;	
			    MediaObj.RSD_Timer=0;			   
			 } 
			
		 }							 

	  }  
     //----------  累加发送报数 --------------------
     if(0==MediaObj.RSD_State)
     {
		 if(MediaObj.Media_currentPacketNum<MediaObj.Media_totalPacketNum)
		  {
		    //  图片
		    if(Photo_sdState.photo_sending==enable)
		       Photo_sdState.SD_packetNum++;
			//  音频 
			if(Sound_sdState.photo_sending==enable)
			Sound_sdState.SD_packetNum++;
			//视频
			if(Video_sdState.photo_sending==enable)
			 Video_sdState.SD_packetNum++; 
		  }
     }
	 else
	 if(1==MediaObj.RSD_State)
	 {
	   MediaObj.RSD_Reader++;
	   if(MediaObj.RSD_Reader==MediaObj.RSD_total)
	   	    MediaObj.RSD_State=2; //  置位等待状态，等待着中心再发重传指令
	 }	
	 //----------  返回  -------------------
	 return true; 

}
//----------------------------------------------------------------------
u8  Stuff_MultiMedia_IndexAck_0802H(void)      
{  
   u16  totalNum=0, lenregwr=0;
   u16  i=0;  
   
   
	// 1. Head
	if(!Protocol_Head(MSG_0x0802,Packet_Normal)) 
 	  return false; 
	 // 2. content     
        //   float ID  应答流水号 
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID;
          
		//------- 多媒体总项数 ----
		lenregwr=Original_info_Wr;		
	    Original_info[Original_info_Wr++]=(u8)(totalNum>>8); // 临时占上位置
	    Original_info[Original_info_Wr++]=(u8)totalNum;

		//----- 查找有效效位置 ----
		totalNum=0;
		  for(i=0;i<8;i++)
		  {
			  if(SD_ACKflag.f_MediaIndexACK_0802H==1)  // 图像
			  {		
				 Api_RecordNum_Read(pic_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));   
			  }
			  else
			  if(SD_ACKflag.f_MediaIndexACK_0802H==2) // 音频
			  {
			       Api_RecordNum_Read(voice_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));   
			  }  
			 // rt_kprintf("\r\n Effective_Flag %d  f_QueryEventCode %d  EventCode %d  \r\n",MediaIndex.Effective_Flag,SD_ACKflag.f_QueryEventCode,MediaIndex.EventCode);
			  if((MediaIndex.Effective_Flag==1)&&(SD_ACKflag.f_QueryEventCode==MediaIndex.EventCode))
			  { //  查找有效的索引和相对应类型的索引
			    Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID>>24); //  多媒体ID dworrd
			    Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID>>16);
				Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID>>8);
				Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID);
			    Original_info[Original_info_Wr++]=MediaIndex.Type; //  多媒体类型
				Original_info[Original_info_Wr++]=MediaIndex.ID;   //  通道
			    Original_info[Original_info_Wr++]=MediaIndex.EventCode;
				memcpy(Original_info+Original_info_Wr,MediaIndex.PosInfo,28);
			    Original_info_Wr+=28;    
				totalNum++;    
			  }
			  
