nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		  }

          //---------   补上总项数  -------- 
          Original_info[lenregwr]=(u8)(totalNum>>8);
		  Original_info[lenregwr+1]=totalNum;     

	 //  3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Media Index \r\n");    
	 return true; 

}
//--------------------------------------------------------------------------------------
u8  Stuff_DriverInfoSD_0702H(void)      
{  
    u8 i=0;
	 // 1. Head
	 if(!Protocol_Head(MSG_0x0702,Packet_Normal))  
 	    return false; 
	
	 // 2. content     
        //   驾驶员姓名长度
        i=strlen((const char*) JT808Conf_struct.Driver_Info.DriveName);
	    Original_info[Original_info_Wr++]=i;
	    memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.DriveName,i);// name
		Original_info_Wr+=i;
        memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.Driver_ID,20);// 身份证号码
        Original_info_Wr+=20;
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.Drv_CareerID,40);//从业资格证
        Original_info_Wr+=40;
		i=strlen((const char*)JT808Conf_struct.Driver_Info.Comfirm_agentID); // 机构名称
		Original_info[Original_info_Wr++]=i;
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.Comfirm_agentID,i);
		Original_info_Wr+=i;
		
	 // 3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Driver Info \r\n");    
	 return true; 

}
//---------------------------------------------------------------------------------
u8  Stuff_Worklist_0701H(void)      
{  
    u32  listlen=215;
	 // 1. Head
	 if(!Protocol_Head(MSG_0x0701,Packet_Normal)) 
 	    return false; 
	
	 // 2. content     
        //   信息长度
	     listlen=207;
		 Original_info[Original_info_Wr++]=(listlen>>24);// 返回事件ID
		 Original_info[Original_info_Wr++]=(listlen>>16);
		 Original_info[Original_info_Wr++]=(listlen>>8);		  
		 Original_info[Original_info_Wr++]=listlen;
	    
        memcpy(Original_info+Original_info_Wr,"托运单位:天津七一二通信广播有限公司 电话:022-26237216  ",55);
        Original_info_Wr+=55;		
        memcpy(Original_info+Original_info_Wr,"承运单位:天津物流运输公司 电话:022-86692666  ",45);
        Original_info_Wr+=45;
		memcpy(Original_info+Original_info_Wr,"物品名称:GPS车载终端  包装方式:  箱式   每箱数量: 20   总量: 30箱  ",67);
        Original_info_Wr+=67;
		memcpy(Original_info+Original_info_Wr,"车型:箱式小货车 运达日期 :  2012-1-11   ",40); 
        Original_info_Wr+=40; 
		
	 // 3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Worklist  \r\n");    
	 return true; 

}
//------------------------------------------------------------------------------------
u8 Stuff_DataTrans_0900_ISP_ACK(u8  AckType)
{  
  u16  TX_NUM=0,Rec_Num=0,i=0;	 
  u8   Gfcs=0;
  //---------------------------------------------
   // 1. Head
   if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
	 return false; 
	// 2. content	
	//	应答流水号
   Original_info[Original_info_Wr++]=1;// 返回透传数据的类型 1	表示远程下载
	// 3. 内容
		//	3.1. Sub Head  
		   Rec_Num=Original_info_Wr; //reglen 
			memcpy(Original_info+Original_info_Wr,"*GB",3); // GPRS 起始头
		   Original_info_Wr+=3;
		   
		   Original_info[Original_info_Wr++]=0x00;	// SIM 号码   最先两个字节填写0x00
		   Original_info[Original_info_Wr++]=0x00;
		   memcpy(Original_info+Original_info_Wr,SIM_code,6);
		   Original_info_Wr+=6;  
  
		   Original_info_Wr+=2;   // 长度增加两个字节，但内容随后填写
		   
		   Original_info[Original_info_Wr++]=0x00; //消息序号 默认 0x00
		 // 3.2 Sub Info			 
			 Original_info[Original_info_Wr-1]=0x01; //消息序号 默认 0x00
			 Original_info[Original_info_Wr++]=0x30; //参数 	必须应答
			 
			 Original_info[Original_info_Wr++]=AckType; // 命令字	

			 switch(AckType)
			 	{
                  case  ISPACK_92:
				  case  ISPoverACK_96:    // 内容为空
				  	               break;
                  case  ISPinfoACK_94:                        
								Original_info[Original_info_Wr++]=(u8)(ISP_current_packnum>>8); // 当前包数
								Original_info[Original_info_Wr++]=(u8)ISP_current_packnum;
								Original_info[Original_info_Wr++]=(u8)(ISP_total_packnum>>8); // 总包数
								Original_info[Original_info_Wr++]=(u8)ISP_total_packnum;
								Original_info[Original_info_Wr++]=ISP_ack_resualt;	// 返回的状态	 
					               break;
                  default:
				  	      return false;
			 	}
  
		 // 3.3 Sub end
			 TX_NUM=Original_info_Wr-Rec_Num; // 子协议的长度
				//----stuff Ginfolen ---- 
			 Original_info[Rec_Num+11]=(u8)((TX_NUM-2)>>8);  // 长度不算头 
			 Original_info[Rec_Num+12]=(u8)(TX_NUM-2); 
			 //rt_kprintf("\r\n   测试	A=%X B=%X	reg=%d Reg=%d  REg=%d \r\n",GPRS_info[11],GPRS_info[12],reg,(u8)(reg<<8),reg&0x00ff);
			
			  Gfcs=0;				  //  计算从电话号码开始到校验前数据的异或和  G 协议校验 
			  for(i=3;i<Original_info_Wr;i++)
				   Gfcs^=Original_info[i]; 
			  Original_info[Original_info_Wr++]=Gfcs;  // 填写G校验位
			
			   
			  Original_info[Original_info_Wr++]=0x0D;  // G 协议尾	
			  Original_info[Original_info_Wr++]=0x0A;						 
	
	//	3. Send 
    Protocol_End(Packet_Normal,1 ); 
   if(DispContent)
   	{
      		 switch(AckType)
			 	{
                  case  ISPACK_92:
				  	              rt_kprintf("\r\n	 发送透传  ISP ID=%2X  ACK \r\n",ISPACK_92);       
				  	               break;
				  case  ISPoverACK_96:    // 内容为空
				                  rt_kprintf("\r\n	 发送透传 ISP ID=%2X  overACK \r\n",ISPoverACK_96); 
				  	               break;
                  case  ISPinfoACK_94:
					              // rt_kprintf("\r\nISP info ACK   current=%d ,totalnum=%d \r\n",ISP_current_packnum,ISP_total_packnum);		
					               break; 
                  default:
				  	      return false;
			 	}
 
   	}
   
   return true; 


}

//----------------------------------------------
u8  Update_HardSoft_Version_Judge(u8 * instr)
{
     //   读取第50 页信息
     	  Device_type=((u32)instr[1]<<24)+((u32)instr[2]<<16)+((u32)instr[3]<<8)+(u32)instr[4];
	  Firmware_ver=((u32)instr[5]<<24)+((u32)instr[6]<<16)+((u32)instr[7]<<8)+(u32)instr[8];
	  rt_kprintf("	\r\n 设备类型: %x  软件版本:%x \r\n",Device_type,Firmware_ver); 
	 
	 if(Device_type!=STM32F407_Recoder_32MbitDF)   
	  { 
		 rt_kprintf( "\r\n 设备类型不匹配不予更新" );
		 return false;
	  }  		   
        else
		  return true;


