nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					  memset(DomainNameStr,0,sizeof(DomainNameStr));					  
					  memset(SysConf_struct.DNSR,0,sizeof(DomainNameStr));
					  memcpy(DomainNameStr,(char*)Content,infolen);   
					  memcpy(SysConf_struct.DNSR,(char*)Content,infolen);   
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));

                                     //----- 传给 GSM 模块------
                                    DataLink_DNSR_Set(SysConf_struct.DNSR,1); 

									 
					  SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
					  break;
					 }
					 memset(reg_str,0,sizeof(reg_str));
					 IP_Str((char*)reg_str, *( u32 * ) RemoteIP_main); 		  
					 strcat((char*)reg_str, " :");		 
					 sprintf((char*)reg_str+strlen((const char*)reg_str), "%u\r\n", RemotePort_main);  
					 memcpy(SysConf_struct.IP_Main,RemoteIP_main,4);
					 SysConf_struct.Port_main=RemotePort_main;
					 
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					 rt_kprintf("\r\n 中心设置主服务器 IP \r\n");
					 rt_kprintf("\r\n SOCKET :");  
					 rt_kprintf((char*)reg_str);   
					  //-----------  Below add by Nathan  ----------------------------				  
					  rt_kprintf("\r\n		   备用IP: %d.%d.%d.%d : %d \r\n",RemoteIP_aux[0],RemoteIP_aux[1],RemoteIP_aux[2],RemoteIP_aux[3],RemotePort_main);   
					 
					  //-----------  Below add by Nathan  ----------------------------
					  DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
	                              //-------------------------------------------------------------	
					   
					   SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  

	                break;
	 case 0x0014:  // 备份服务器 APN

	                break;
	 case 0x0017:  // 备份服务器  IP                    
				  memset(reg_in,0,sizeof(reg_in)); 
				  memcpy(reg_in,Content,infolen);
				 //---------------------------- 
				  i =str2ip((char*)reg_in, RemoteIP_aux);
				  if (i <= 3)
				 {
					  rt_kprintf("\r\n  域名aux: %s \r\n",reg_in); 					  
					 memset(DomainNameStr_aux,0,sizeof(DomainNameStr_aux));					  
					 memset(SysConf_struct.DNSR_Aux,0,sizeof(DomainNameStr_aux));     
					  memcpy(DomainNameStr_aux,(char*)Content,infolen);   
					  memcpy(SysConf_struct.DNSR_Aux,(char*)Content,infolen);    
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
                                     //----- 传给 GSM 模块------
                                    DataLink_DNSR2_Set(SysConf_struct.DNSR_Aux,1);
									 
					  SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
					  break;
				 }  				  
				  memset(reg_str,0,sizeof(reg_str));
				  IP_Str((char*)reg_str, *( u32 * ) RemoteIP_aux);		   
				  strcat((char*)reg_str, " :"); 	  
				  sprintf((char*)reg_str+strlen((const char*)reg_str), "%u\r\n", RemotePort_aux);  
				 
				  Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
				  rt_kprintf("\r\n 中心设置备用服务器 IP \r\n");
				  rt_kprintf("\r\nUDP SOCKET :");  
				  rt_kprintf((char*)reg_str);  
				  DataLink_AuxSocket_set(RemoteIP_aux,RemotePort_aux,1);
				   //-----------  Below add by Nathan  ----------------------------				   
				   rt_kprintf("\r\n 		备用IP: %d.%d.%d.%d : %d \r\n",RemoteIP_aux[0],RemoteIP_aux[1],RemoteIP_aux[2],RemoteIP_aux[3],RemotePort_aux);	
	                break;
	 case 0x0018:  //  服务器 TCP 端口
                    //----------------------------	
                      if(infolen!=4)
						break;	
					  RemotePort_main=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];

					  Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					  rt_kprintf("\r\n 中心设置主服务器 PORT \r\n");
					  rt_kprintf("\r\nUDP SOCKET :");  
					  rt_kprintf((char*)reg_str);  
					   //-----------  Below add by Nathan  ----------------------------
                                     DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);					   //-------------------------------------------------------------		   
					   SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断	
	                break;
	 case 0x0019:  //  服务器 UDP 端口
                    
					if(infolen!=4)
					  break;  
					RemotePort_aux=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
					
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					rt_kprintf("\r\n 中心设置UDP服务器 PORT \r\n");
					rt_kprintf("\r\nUDP SOCKET :");   
					rt_kprintf((char*)reg_str);    
					rt_kprintf("\r\n		 备用IP: %d.%d.%d.%d : %d \r\n",RemoteIP_aux[0],RemoteIP_aux[1],RemoteIP_aux[2],RemoteIP_aux[3],RemotePort_aux);	 
	                break;
     case 0x0020:  //  汇报策略  0 定时汇报  1 定距汇报 2 定时和定距汇报
                    if(infolen!=4)
						break;	
                    resualtu32=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
					switch(resualtu32)
						{
						   case 0:rt_kprintf("\r\n 定时汇报 \r\n");
						   	      break;
						   case 1:rt_kprintf("\r\n 定距汇报 \r\n");
						   	      break;
						   case 2:rt_kprintf("\r\n 定时和定距汇报\r\n"); 
						   	      break;
						   default:
						   	      break;

						}
	                break;
	 case 0x0021:  //  位置汇报方案  0 根据ACC上报  1 根据ACC和登录状态上报 

	                break;
       //--------
					
	 case 0x0022:  //  驾驶员未登录 汇报时间间隔 单位:s    >0	                  
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.NoDrvLogin_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                                   rt_kprintf("\r\n 驾驶员未登录汇报间隔: %d\r\n",JT808Conf_struct.DURATION.NoDrvLogin_Dur);  
	                break;
	 case 0x0027:   //  休眠时汇报时间间隔，单位 s  >0	                
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.Sleep_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                    rt_kprintf("\r\n 休眠汇报时间间隔: %d \r\n",JT808Conf_struct.DURATION.Sleep_Dur);   
	                break;
	 case 0x0028:   //  紧急报警时汇报时间间隔  单位 s	                
                    if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.Emegence_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
                    rt_kprintf("\r\n 紧急报警时间间隔: %d \r\n",JT808Conf_struct.DURATION.Emegence_Dur);   
	                break;
	 case 0x0029:   //  缺省时间汇报间隔  单位 s
	                if(infolen!=4)
						break;					
					JT808Conf_struct.DURATION.Default_Dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
					rt_kprintf("\r\n 缺省汇报时间间隔: %d \r\n",JT808Conf_struct.DURATION.Default_Dur);   
	                break;
       //---------
					
