nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
    return true;
}
//--------------------------------------------------------------------
u8  CentreSet_subService_8105H(u32 Control_ID, u8 infolen, u8 *Content )
{

   switch(Control_ID) 
   {
      case 1:  //  无线升级参数  参数之间采用分号分隔   指令格式如下:
             /*
URL 地址；拨号名称；拨号用户名；拨号密码；地址；TCP端口；UDP端口；制造商ID; 硬件版本；固件版本；连接到指定服务器指定是服务器时限；
           若某个参数无数值，则放空
               */
             rt_kprintf("\r\n 无线升级 \r\n");  
			 rt_kprintf("\r\n 内容: %s\r\n",Content); 
		     break;
	  case 2:  // 控制终端连接指定服务器
	        /*
连接控制；监管平台鉴权码；拨号点名称； 拨号用户名；拨号密码；地址；TCP端口；UDP端口；连接到指定服务器时限
           若每个参数无数值，则放空
	         */  
	         rt_kprintf("\r\n 终端控制连接指定服务器\r\n");  
			 rt_kprintf("\r\n 内容: %s\r\n",Content);
			 break;
	  case 3:  //  终端关机
              SD_ACKflag.f_CentreCMDack_0001H=5; 
			  rt_kprintf("\r\n 终端关机 \r\n");  
	         break;
      case 4:  //  终端复位
               SD_ACKflag.f_CentreCMDack_0001H=3;
			   rt_kprintf("\r\n 终端复位 \r\n");          
	         break;
	  case 5: //   终端恢复出厂设置		 		  	       
	           /* if(SysConf_struct.Version_ID==SYSID)   //  check  wether need  update  or not 
	          	{                    
					SysConf_struct.Version_ID=SYSID+1;   
					Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					Systerm_Reset_counter=Max_SystemCounter;
					ISP_resetFlag=2;    //   借助远程下载重启机制复位系统 
	          	}
				rt_kprintf("\r\n 恢复出厂设置 \r\n"); */ 
			 break;
	  case 6: //   关闭数据通信
             SD_ACKflag.f_CentreCMDack_0001H=5; 
			 rt_kprintf("\r\n 关闭数据通信 \r\n"); 
	         break;
	  case 7: //   关闭所有无线通信
             SD_ACKflag.f_CentreCMDack_0001H=5; 
			 rt_kprintf("\r\n 关闭所有通信 \r\n");   
		     break;
	  default:
	  	     return false;			 

   }
      return  true;
}

//-------------------------------------------------------------------
void CenterSet_subService_8701H(u8 cmd,  u8*Instr)
{  
   TDateTime now;
   u32  reg_dis=0; 
  
  switch(cmd)
   {
	 case 0x82: //	  中心设置车牌号  
				memset(JT808Conf_struct.Vechicle_Info.Vech_VIN,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_VIN));
				memset(JT808Conf_struct.Vechicle_Info.Vech_Num,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Num));
				memset(JT808Conf_struct.Vechicle_Info.Vech_Type,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Type));	
				
				 //-----------------------------------------------------------------------
				 memcpy(JT808Conf_struct.Vechicle_Info.Vech_VIN,Instr,17);
				 memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,Instr+17,12);
				 memcpy(JT808Conf_struct.Vechicle_Info.Vech_Type,Instr+29,12); 

				Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));    
				break;
	 case 0xC2: //设置记录仪时钟
			    // 没啥用，给个回复就行，俺有GPS校准就够了 
			    //  年月日 时分秒 BCD
			    now.year=(Instr[0]>>4)*10+(Instr[0]&0x0F);  
				now.month=(Instr[1]>>4)*10+(Instr[1]&0x0F);   
				now.day=(Instr[2]>>4)*10+(Instr[2]&0x0F);  
				now.hour=(Instr[3]>>4)*10+(Instr[3]&0x0F);  
				now.min=(Instr[4]>>4)*10+(Instr[4]&0x0F);  
				now.sec=(Instr[5]>>4)*10+(Instr[5]&0x0F);      
				now.week=1;      
	            Device_RTC_set(now);    
		        break;

	 case 0xC3: //车辆速度脉冲系数（特征系数）
	              // 前6 个是当前时间
	                  now.year=(Instr[0]>>4)*10+(Instr[0]&0x0F);  
				now.month=(Instr[1]>>4)*10+(Instr[1]&0x0F);   
				now.day=(Instr[2]>>4)*10+(Instr[2]&0x0F);  
				now.hour=(Instr[3]>>4)*10+(Instr[3]&0x0F);  
				now.min=(Instr[4]>>4)*10+(Instr[4]&0x0F);  
				now.sec=(Instr[5]>>4)*10+(Instr[5]&0x0F);      
				now.week=1;      
	            Device_RTC_set(now);   
				 JT808Conf_struct.Vech_Character_Value=(Instr[6]<<8)+(u32)Instr[7]; // 特征系数  速度脉冲系数
				 JT808Conf_struct.DF_K_adjustState=0; 		
		                ModuleStatus&=~Status_Pcheck; 
	                      Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		        break;
	 case 0x83: //  记录仪初次安装时间
                
			    memcpy(JT808Conf_struct.FirstSetupDate,Instr,6); 
				Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
	            break;
	 case 0x84: // 设置信号量配置信息
	            memcpy(Setting08,Instr,80);
				break;
	  
	 case 0xC4: //   设置初始里程	
	          
            /*   Time2BCD( Original_info + Original_info_Wr );                       // 记录仪实时时间
				Original_info_Wr					+= 6;
				Original_info[Original_info_Wr++]	= 0x13;                         // 初次安装时间
				Original_info[Original_info_Wr++]	= 0x03;
				Original_info[Original_info_Wr++]	= 0x01;
				Original_info[Original_info_Wr++]	= 0x08;
				Original_info[Original_info_Wr++]	= 0x30;
				Original_info[Original_info_Wr++]	= 0x26; 
			*/
                 now.year=(Instr[0]>>4)*10+(Instr[0]&0x0F);  
				now.month=(Instr[1]>>4)*10+(Instr[1]&0x0F);   
				now.day=(Instr[2]>>4)*10+(Instr[2]&0x0F);  
				now.hour=(Instr[3]>>4)*10+(Instr[3]&0x0F);  
				now.min=(Instr[4]>>4)*10+(Instr[4]&0x0F);  
				now.sec=(Instr[5]>>4)*10+(Instr[5]&0x0F);      
				now.week=1;      
	            Device_RTC_set(now);   


			
			memcpy(JT808Conf_struct.FirstSetupDate,Instr+6,6);  
			Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
			     // instr     + 12      设置初始里程的位置   BCD
			     
			/*reg_dis=(Instr[12]>>4)*10000000+(Instr[12]&0x0F)*1000000+(Instr[13]>>4)*100000+(Instr[13]&0x0F)*10000 \
			       +(Instr[14]>>4)*1000+(Instr[14]&0x0F)*100+(Instr[15]>>4)*10+(Instr[15]&0x0F);  

			JT808Conf_struct.Distance_m_u32=reg_dis*100;  
			Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); */
		/*	//--- 初始里程
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			// -- 累积里程 3个字节 单位0.1km    6位
			regdis								= JT808Conf_struct.Distance_m_u32 / 100; //单位0.1km
			reg2								= regdis / 100000;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= ( reg2 << 4 ) + ( regdis % 100000 / 10000 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 10000 / 1000 ) << 4 ) + ( regdis % 1000 / 100 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 100 / 10 ) << 4 ) + ( regdis % 10 );
			*/
			chushilicheng[0]	=Instr[12];
			chushilicheng[1]	=Instr[13];
			chushilicheng[2]    =Instr[14];
			chushilicheng[3]	= Instr[15];  

			leijilicheng[0]	=Instr[16];
			leijilicheng[1]	=Instr[17];
			leijilicheng[2] =Instr[18];
			leijilicheng[3]	= Instr[19];
	              
	             break;
	 default:
	 	        Recode_Obj.Error=2; // 设置错误
				break;
   }

   if(Recode_Obj.Error!=2)
        VDR_product_14H(cmd);     
    
