nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
  switch(SubID)
   {
     case 0x0001:  // CAN ID 设置
                    if(infolen<4)
						break;			 		
		        // Content[0];  //  设置属性
			  //Content[1] ;//本消息中包含CAN ID 的数量
		     //------------------------------------	  
			//Content[2];  //  CAN ID 的ID 			
		     if(Content[3]&0x80)//  CAN ID   的属性  
		     	{
			      BD_EXT.CAN_2_ID=(Content[4]<<24)+(Content[5]<<16)+(Content[6]<<8)+Content[7];// 
                            if(Content[3]&0x40)
					 BD_EXT.CAN_2_Type=1; // 标准帧
				else 
					 BD_EXT.CAN_2_Type=0;  
			      BD_EXT.CAN_2_Duration=(Content[9]<<8)+Content[10];   // 0   表示停止

				 
				//     得有个和小板通信的处理
				memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));		 
				u3_Txstr[0]=0x7E;       // 头
			       u3_Txstr[1]=0x33;		//  CAN 相关
			       u3_Txstr[2]=0x02;    //  参数设置 
			       u3_Txstr[3]=Content[3]; // 属性
			       u3_Txstr[4]=Content[4]; //  ID 
				u3_Txstr[5]=Content[5];   	
		              u3_Txstr[6]=Content[6];	       
	                     u3_Txstr[7]=Content[7];
				u3_Txstr[8]=Content[8]; // ID 		 
				u3_Txstr[9]=Content[9]; 	//
				u3_Txstr[10]=Content[10]; 	
				u3_Txstr[11]=0x7E;	              				 

				 Destu3_Txstr[0]=0x7E;
			        len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 10);  
			        Destu3_Txstr[len+1]=0x7E;

			       rt_kprintf("\r\nU3_len=%d   :\r\n",len);  
			       for(i=0;i<len+2;i++)
				        rt_kprintf("% 02X",Destu3_Txstr[i]);     	 
				   
			       // U3_PutData(Destu3_Txstr,len+2);  //  发送给串口	
			       rt_device_write(&Device_CAN2,0, Destu3_Txstr,len+2);       
				rt_kprintf("\r\n 中心设置CAN2 : 0x%08X   Dur: %d s\r\n",BD_EXT.CAN_2_ID,BD_EXT.CAN_2_Duration);     
			        //----------------------------------
			 } 
			 else
     			   {
      			       BD_EXT.CAN_1_ID=(Content[4]<<24)+(Content[5]<<16)+(Content[6]<<8)+Content[7];// 
                             if(Content[3]&0x40)   
					 BD_EXT.CAN_1_Type=1; // 标准帧
				else 
					 BD_EXT.CAN_1_Type=0;   
				 BD_EXT.CAN_1_Duration=(Content[9]<<8)+Content[10];  // 0   表示停止  

				rt_kprintf("\r\n 中心设置CAN1 : 0x%08X   Dur: %d s\r\n",BD_EXT.CAN_1_ID,BD_EXT.CAN_1_Duration);    

			   }   
                    BD_EXT_Write();    
                    break;
	 case 0x0002:  // 文本信息标志含义     
	            // Content[0]; // 没用
	              //if((Content[1]==0)||(Content[1]==1))  //  部分类型都给显示屏 
	             	{
				memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
				DwinLCD.TxInfolen=AsciiToGb(TextInfo.TEXT_Content,infolen-2,Content+2);
				//memcpy(TextInfo.TEXT_Content,Content+2,infolen-2);
				TextInfo.TEXT_SD_FLAG=1;	// 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||
                            rt_kprintf("\r\n  CAN 文本:  "); 
				for(i=0;i<DwinLCD.TxInfolen;i++) 
							 rt_kprintf("%c",TextInfo.TEXT_Content[i]);
				  rt_kprintf("\r\n ");
			}	

		          #ifdef LCD_5inch
						           //======  信息都在屏幕上显示  
                                                   memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-2,Content+2);  						  
							  DwinLCD.Type=LCD_SDTXT;  						
							   
			   #endif  		

		      break;
	 default: 
				return false;
   }
    return true;
}
//-----------------------------------------------
void  ISP_Get_RawData(u8 * Instr, u16  InLen)
{
      memcpy(ISP_Raw,Instr,InLen);
      ISP_NeedtoProcessFlag=1;	 	
}
void Nullpro_8900H(u8*Instr)
{  
      u16	i=0,DF_PageAddr=0;
	  u16  infolen=0;//,contentlen=0;
	  u8   New_CMD=0;
	//  u8   CenterAckCameraFlag=0;
	//  u8   ireg[5]; 
	  u8   FCS_RX_UDP_sub=0;

  //  2.   get infolen    CMD 
  infolen=( u16 )(Instr[11] << 8 ) + ( u16 ) Instr[12]; 
//  contentlen=infolen-14;  //  8+2+1+1+1+1
  New_CMD = Instr[15];  
 //   4 .  Classify  Process 
   // rt_kprintf("\r\n New_CMD=%X",New_CMD);
     switch(New_CMD)
   {
  		   case  0x91:     //   中心下发远程下载开始命令
					       ISP_rxCMD=New_CMD; 
						f_ISP_ACK=1;						
							rt_kprintf( "\r\n ISP request! \r\n" ); 					   
						//------------- ISP state ------------------------	
						ISP_running_state=1;
						ISP_running_counter=0;
						ISP_RepeatCounter=0;
					  break;
		   case  0x93:     //   中心下发远程下载数据内容命令
		                       rt_kprintf("\r\n infolen=%d",infolen);
                                     //--------------------------------------- 
                                    ISP_current_packnum=((u16)Instr[16]<<8)+(u16)Instr[17];
					  ISP_total_packnum=((u16)Instr[18]<<8)+(u16)Instr[19]; 
					    ISP_ack_resualt=0x01;   // ok		
						ISP_RepeatCounter=0;
					  //--------------------------------------		   
				        ISP_running_state=1;
					 ISP_running_counter=0;   			                
					 f_ISP_88_ACK=1;			
					  break;
		   case  0x95:     //   中心下发远程下载结束命令
					   f_ISP_23_ACK=1;					   
					   rt_kprintf( "\r\n ISP download over! \r\n" ); 
					   //------------- ISP state ------------------------  
					   ISP_running_state=1;
					   ISP_running_counter=0; 
					   ISP_RepeatCounter=0; 
			          break;
		    default:
				      break;  	
   }


}


void DataTrans_ISPService_8900H(u8*Instr)
{  
      u16	i=0,DF_PageAddr=0;
	  u16  infolen=0;//,contentlen=0;
	  u8   New_CMD=0;
	//  u8   CenterAckCameraFlag=0;
	//  u8   ireg[5]; 
	  u8   FCS_RX_UDP_sub=0;
  //  1. Sub Protocol check 
   if(strncmp((char*)Instr, "*GB",3) != 0)           //   过滤头 
  	   return;
 
  //  2.   get infolen    CMD 
  infolen=( u16 )(Instr[11] << 8 ) + ( u16 ) Instr[12]; 
//  contentlen=infolen-14;  //  8+2+1+1+1+1
  New_CMD = Instr[15];  

  //  3.   Check  Fcs  
	  FCS_RX_UDP_sub=0;
	  for ( i=0; i <(infolen-1); i++ ) //先算出收到数据的异或和  长度包括校验所以信息长度应减1
		  {
			  FCS_RX_UDP_sub^=Instr[3+i];	
		  } 
	  // ------- FCS filter -----------------
	  if( Instr[infolen+2]!= FCS_RX_UDP_sub ) 	   
		  {
			  rt_kprintf("\r\n ISP校验错误	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP_sub,Instr[infolen+2]); 
				//-----------------  memset  -------------------------------------
			  return; 
		  }
	  else		 
		  rt_kprintf("\r\nISP校验正确	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP_sub,Instr[infolen+2]);	  
   
 //   4 .  Classify  Process 
   // rt_kprintf("\r\n New_CMD=%X",New_CMD);
     switch(New_CMD)
   {
  		   case  0x91:     //   中心下发远程下载开始命令
					       ISP_rxCMD=New_CMD; 
						f_ISP_ACK=1;						
							rt_kprintf( "\r\n ISP request! \r\n" ); 					   
						//------------- ISP state ------------------------	
						ISP_running_state=1;
						ISP_running_counter=0;
						ISP_RepeatCounter=0;
					  break;
		   case  0x93:     //   中心下发远程下载数据内容命令
		                       rt_kprintf("\r\n infolen=%d",infolen);
		               #if 0
						if(532!=infolen)   
						{
							  ISP_current_packnum=((u16)Instr[16]<<8)+(u16)Instr[17]; 
							  ISP_total_packnum=((u16)Instr[18]<<8)+(u16)Instr[19]; 
							 // rt_kprintf("\r\n ISP_current_packnum=%d,ISP_total_packnum=%d",ISP_current_packnum,ISP_total_packnum);
						
							  f_ISP_88_ACK=1;
							  ISP_ack_resualt=0x02;   // no  pass
							  rt_kprintf( "\r\n Total packet len	error! \r\n" );
						}
						else
						  {
							   ISP_current_packnum=((u16)Instr[16]<<8)+(u16)Instr[17];
							   ISP_total_packnum=((u16)Instr[18]<<8)+(u16)Instr[19]; 
					         //  rt_kprintf("\r\n ISP_current_packnum=%d,ISP_total_packnum=%d",ISP_current_packnum,ISP_total_packnum);
						
