nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
								if(ISP_current_packnum<=ISP_total_packnum)
								  {
							   
									//------------------------------
									DF_PageAddr=(u16)(Instr[20]<<8)+Instr[21];  //page
									//rt_kprintf("\r\n 写入Page=%d\r\n",DF_PageAddr);
						
									//-----------  protect	RAM data  ------
									if((DF_PageAddr>=DF_BL_PageNo)&&(DF_PageAddr<DF_PageAddr))
										break; 
									
									//---------------- write APP data --------- 
									ISP_Format(DF_PageAddr,0,Instr+22,PageSIZE);
					
									//rt_kprintf("\r\n写内容:\r\n ");
									//for(i=0;i<PageSIZE;i++)
										//rt_kprintf("%X ",Instr[22+i]);
								    // rt_kprintf("\r\n读内容:\r\n ");	
								      rt_thread_delay(5); 
								       rt_kprintf("\r\n清除ISP 区域\r\n ");	
									ISP_Read(DF_PageAddr, ISP_buffer,PageSIZE);  
									//for(i=0;i<PageSIZE;i++)
									//	rt_kprintf("%X ",ISP_buffer[i]);
									//rt_kprintf("\r\n"); 
									for(i=0;i<PageSIZE;i++)
									{
										 if(Instr[22+i]!=ISP_buffer[i]) 
										   {
											   //------------- ISP state ------------------------
											   ISP_running_state=1;
											   ISP_running_counter=0; 
											   rt_kprintf( "\r\n i=%d  读取和写不匹配! \r\n",i );  
											   break; 
										   }
									}  									
									if(i<PageSIZE)
									 {
									   rt_kprintf( "\r\n DFwrite error!\r\n" );
									   ISP_ack_resualt=0x02;   // no pass
									   ISP_RepeatCounter++;
									   if(ISP_RepeatCounter>6)
									   	{
                                                                          ISP_RepeatCounter=0;
										    rt_kprintf("\r\n 超过最大错误5次数，清除远程升级区域!\r\n");
                                                                          DF_ClearUpdate_Area();  
									   	}
									 } 
									else  
										
									 {
									   ISP_ack_resualt=0x01;   // ok		
									   ISP_RepeatCounter=0;
									 } 
								   //---------------------------------
								   rt_thread_delay(10);  // 不加会导致堆栈溢出
								   
								   f_ISP_88_ACK=1;								   
						  }
				             }
						//------------- ISP state ------------------------
					#endif	
				        ISP_running_state=1;
					 ISP_running_counter=0;   			                
					 f_ISP_88_ACK=1;			
					  break;
		   case  0x95:     //   中心下发远程下载结束命令
					   f_ISP_23_ACK=1;					   
					   rt_kprintf( "\r\n ISP download over! \r\n" ); 
					   //------------- ISP state ------------------------  
					   ISP_running_state=1;
					   ISP_running_counter=0; 
					   ISP_RepeatCounter=0; 
			          break;
		    default:
				      break;  	
   }


}
void  ISP_Process(void)
{
      if(1==ISP_NeedtoProcessFlag)
      	{
      	      rt_kprintf( "\r\n ISP _process \r\n" ); 
      	     //DataTrans_ISPService_8900H(ISP_Raw);
      	     f_ISP_ACK=1;	
            ISP_running_state=1;
		ISP_running_counter=0;
		ISP_RepeatCounter=0;
	     //----------------------		 
            ISP_NeedtoProcessFlag=0;
      	}	
}


u8 ISP_running_Status(void)
{ 
     return   ISP_running_state;
}

//-------------------------------------------
void  Media_Start_Init( u8  MdType , u8  MdCodeType)
{  
  MediaObj.Media_Type=MdType;//	指定当前传输多媒体的类型   0  表示图片
  MediaObj.Media_CodeType=MdCodeType;  //  多媒体编码格式   0  表示JPEG	格式 
  MediaObj.SD_media_Flag=1;   //  置多媒体事件信息发送标志位  ，开始图片传输  
  MediaObj.SD_Eventstate=1;		  //  开始处于发送状态 
  MediaObj.RSD_State=0;  
  MediaObj.RSD_Timer=0;
  MediaObj.RSD_total=0;
  MediaObj.RSD_Reader=0;
  MediaObj.SD_Data_Flag=0; 
  MediaObj.Media_transmittingFlag=0;      
   //------------  add  for debuging   --------------
  // Media_Clear_State();  //  clear  
 /*  if(0==MediaObj.Media_Type)
	{
	   Photo_sdState.photo_sending=enable; 
	   Photo_sdState.SD_packetNum=1; // 第一包开始  
	   rt_kprintf("\r\n 开始上传照片! ....\r\n");  												
    }
  */
   //---------------------------------------------------- 
}

void Media_Clear_State(void)
{
     // 不清楚Meia Type
    MediaObj.MaxSd_counter=0;
    MediaObj.SD_Eventstate=0;
    MediaObj.SD_timer=0;
    MediaObj.SD_media_Flag=0;	
	MediaObj.SD_Data_Flag=0; 
	MediaObj.RSD_State=0;
	MediaObj.RSD_Timer=0;
	MediaObj.RSD_total=0;
	MediaObj.RSD_Reader=0;
	MediaObj.Media_transmittingFlag=0;
}
void  Media_Timer(void)
{
  if(1==MediaObj.SD_Eventstate) 
  	{
  	  MediaObj.SD_timer++;
      if(MediaObj.SD_timer>6) 
      	{
            MediaObj.SD_timer=0;			
            MediaObj.SD_media_Flag=1; 
			MediaObj.MaxSd_counter++;
			if(MediaObj.MaxSd_counter>5)
                   Media_Clear_State();  
      	}

  	}
}
void Media_RSdMode_Timer(void)
{
    if((1==MediaObj.RSD_State))
	   	{ 
	        MediaObj.RSD_Timer++;
			if(MediaObj.RSD_Timer>10)
				{
	              MediaObj.RSD_Timer=0;
				  MediaObj.SD_Data_Flag=1; // 置重传发送多媒体信息标志位
				  switch(MediaObj.Media_Type)    //   图片重传包数
				  	{
				  	 case 0://  图像
				  	         Photo_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                         Photo_sdState.SD_flag=1;
							 break;
					 case 1:// 音频                             
				  	         Sound_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                         Sound_sdState.SD_flag=1;  
					         break;
					 case 2:// 视频
							 Video_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
							 Video_sdState.SD_flag=1;  					          
					         break;
				     default:
					 	     break;

				  	}	
				}
	   	} 
      else
	  if(2==MediaObj.RSD_State)
	  {
          MediaObj.RSD_Timer++;		  
		  if(MediaObj.RSD_Timer>120)   //   如果状态一直在等待且超过30s择清除状态 
		  { 
		     switch (MediaObj.Media_Type)
	         {
	          case 0 : // 图像
	                  Photo_send_end();  // 拍照上传结束
	                  
			          break;
			  case 1 : // 音频
			         Sound_send_end();  
			          break;
			  case 2 : // 视频
                               Video_send_end();
			          break;
			  default:
			  	      break;
	         } 
            Media_Clear_State();
			rt_kprintf("\r\n 信息重传超时结束! \r\n");
			
			Check_MultiTakeResult_b4Trans();  // 多路摄像头拍照状态检测
			
