nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                         //--------------判断所有的设置结果  ---------------
                        /* for(i=0;i<Total_ParaNum;i++)
                         {
                             if(!((Process_Resualt>>0)&0x01))
						     	{
                                  Ack_Resualt=1; //  1  表示失败
                                  break; 
						     	}
							 if(i==(Total_ParaNum-1))  //  设置到最后一个确认成功
							 	Ack_Resualt=0;  //  成功/确认
                         }*/
						 Ack_Resualt=0;
                      }	
					  
						 //-------------------------------------------------------------------
						 if(SD_ACKflag.f_CentreCMDack_0001H==2)
						 {                  
						    Ack_Resualt=0;
							SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
						 }
						 else
                         if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         } 	 
						  rt_kprintf("\r\n  Set Device !\r\n");   
						  
		              break;  
		   case  0x8104:    //  查询终端参数
                      SD_ACKflag.f_SettingPram_0104H=1;  // 不管什么内容回复统一结果
                      rt_kprintf("\r\n  中心查询终端参数 !\r\n");   
			          break;
           case  0x8105:     // 终端控制
                    // Ack_Resualt=0; 
                     if(contentlen)
                      {                       // 和中心商议好了每次只下发操作一项设置
                         Total_ParaNum=UDP_HEX_Rx[13]; //  终端控制命令字 
                         rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum); 
						 //------------------------------------------------------------------- 
						 if(CentreSet_subService_8105H(Total_ParaNum,contentlen-1,UDP_HEX_Rx+14)) 
                                Ack_Resualt=0;   // 返回成功						   
                       }	
					 
						 //-------------------------------------------------------------------
						 Ack_Resualt=0;
					   if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         }	 
						  rt_kprintf("\r\ny  终端控制 !\r\n"); 
						  
		              break;
		   case  0x8201:     // 位置信息查询    位置信息查询消息体为空
		               SD_ACKflag.f_CurrentPosition_0201H=1;		
					   rt_kprintf("\r\n  位置信息查询 !\r\n");  
		              break;
		   case  0x8202:     // 临时位置跟踪控制
		                 Ack_Resualt=0;

						 //  13 14  时间间隔 
					     JT808Conf_struct.RT_LOCK.Lock_Dur=(UDP_HEX_Rx[13]<<8)+UDP_HEX_Rx[14];
					    //  15 16  17 18 对应终端的消息
                         JT808Conf_struct.RT_LOCK.Lock_KeepDur=(UDP_HEX_Rx[15]<<24)+(UDP_HEX_Rx[16]<<16)+(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];

                         JT808Conf_struct.RT_LOCK.Lock_state=1;    // Enable Flag
						 JT808Conf_struct.RT_LOCK.Lock_KeepCnter=0;  //  保持计数器
						 Current_SD_Duration=JT808Conf_struct.RT_LOCK.Lock_KeepDur;  //更改发送间隔						 

						 JT808Conf_struct.SD_MODE.DUR_TOTALMODE=1;   // 更新定时相关状态位
						 JT808Conf_struct.SD_MODE.Dur_DefaultMode=1; 
						 //  保存配置
						 Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
						 
		                // if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     Ack_Resualt=0;
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;      
                         }
                      rt_kprintf("\r\n  临时位置跟踪控制!\r\n"); 
		              break;
		   case  0x8300:    //  文本信息下发
		                  Ack_Resualt=0;
                          TextInfo.TEXT_FLAG=UDP_HEX_Rx[13];
						  if(TextInfo.TEXT_FLAG&0x09)  // 检测是否给TTS终端  ，紧急也给TTS播报
						  {
						      
							  Dev_Voice.CMD_Type='2';
							  memset(Dev_Voice.Play_info,0,sizeof(Dev_Voice.Play_info));
                                                   memcpy(Dev_Voice.Play_info,UDP_HEX_Rx+14,infolen-1);
							  Dev_Voice.info_sdFlag=1;

							//#ifdef LCD_5inch
							   //DwinLCD.Type=LCD_SDTXT;
							 // memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   //DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);  						  
							//#endif   
                                                   //  TTS  
							   TTS_Get_Data(UDP_HEX_Rx+14,infolen-1);

						  }
						 if((TextInfo.TEXT_FLAG&0x04)||(TextInfo.TEXT_FLAG&0x01))  // 检测是否给终端显示器
						 {   
						     //    1. 短信设置命令
						     if( strncmp( (char*)UDP_HEX_Rx+14, "TW703#", 6 ) == 0 )                                                //短信修改UDP的IP和端口
								{
									//-----------  自定义 短息设置修改 协议 ----------------------------------
									SMS_protocol( (UDP_HEX_Rx+14)+ 5,(infolen-1)- 5 ,SMS_ACK_none);  
								}    
						     //     2. 正常短信
							memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
							memcpy(TextInfo.TEXT_Content,UDP_HEX_Rx+14,infolen-1);
							TextInfo.TEXT_SD_FLAG=1;	// 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||

							//========================================
							TextInforCounter++;
							rt_kprintf("\r\n写入收到的第 %d 条信息,消息长度=%d,消息:%s",TextInforCounter,infolen-1,TextInfo.TEXT_Content);
							TEXTMSG_Write(TextInforCounter,1,infolen-1,TextInfo.TEXT_Content);				
							//========================================
						 } 

						  #ifdef LCD_5inch
						           //======  信息都在屏幕上显示  
                                                	  DwinLCD.Type=LCD_SDTXT;
							  memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);  						  
   						#endif    

                          //------- 返回 ----
						 //  if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {   
						      Ack_Resualt=0;
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         }
						   rt_kprintf("\r\n 文本信息: %s\r\n",TextInfo.TEXT_Content);
		              break; 
		   case  0x8301:    //  事件设置 
					   if(contentlen)
                      {                       
                         //--- 设置类型--
                         switch(UDP_HEX_Rx[13])
                         {
                            case 0 :  //  删除终端现有所有事件，该命令后不带后继字符
                                      Event_Init(1); 	
                                      rt_kprintf("\r\n 删除所有事件\r\n");
                                      break; 
							case 1:  // 更新事件
									 if(UDP_HEX_Rx[13]==1)
									 	rt_kprintf("\r\n 更新事件\r\n");
							         //break;
							case 2:  // 追加事件
                                     if(UDP_HEX_Rx[13]==2)
									 	rt_kprintf("\r\n 追加事件\r\n");
							          //break;
							case 3:  // 修改事件
                                     if(UDP_HEX_Rx[13]==3)
									 	 rt_kprintf("\r\n 修改事件\r\n");  
							          //break;
							case 4:  // 删除特定事件       
							         if(UDP_HEX_Rx[13]==4)
									 	 rt_kprintf("\r\n 删除特点事件\r\n"); 
									  Total_ParaNum=UDP_HEX_Rx[14]; // 中心设置参数总数
									  rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum);
									  if(Total_ParaNum!=1)
										 break;
									  //-------------------------------
									  if((UDP_HEX_Rx[15]>8)&&(UDP_HEX_Rx[15]==0))
									     EventObj.Event_ID=0;
									  else
									  	 EventObj.Event_ID=UDP_HEX_Rx[15];
									  
									  EventObj.Event_Len=UDP_HEX_Rx[16];
									  memset(EventObj.Event_Str,0,sizeof(EventObj.Event_Str));
									  memcpy(EventObj.Event_Str,UDP_HEX_Rx+17,EventObj.Event_Len);
									  EventObj.Event_Effective=1; 
                                                                 Api_RecordNum_Write(event_808, EventObj.Event_ID, (u8*)&EventObj,sizeof(EventObj));									  rt_kprintf("\r\n 事件内容:%s\r\n",EventObj.Event_Str);   
									  rt_kprintf("\r\n 事件内容:%s\r\n",EventObj.Event_Str);   
							          break;
							default:
								      break;

