nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                         }

                          //---------返回 -------
                         // if(SD_ACKflag.f_CentreCMDack_0001H==0) // 一般回复
 					      {
		  						 SD_ACKflag.f_CentreCMDack_0001H=1;
		  						 Ack_Resualt=0;
		  						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					       }
						  /*
						  if(SD_ACKflag.f_CurrentEventACK_0301H==0)
						  {
							  SD_ACKflag.f_CurrentEventACK_0301H=1; 
						  }
                              */
					   }
                          
		              break;			  
		   case  0x8302:    // 提问下发
						 // if(UDP_HEX_Rx[13]&0x08)  // 检测标志是否给显示终端 
						   rt_kprintf("\r\n  中心下发提问 \r\n"); 
						  {
						     ASK_Centre.ASK_infolen=UDP_HEX_Rx[14];
							 memset(ASK_Centre.ASK_info,0,sizeof(ASK_Centre.ASK_info));
							 memcpy(ASK_Centre.ASK_info,UDP_HEX_Rx+15,ASK_Centre.ASK_infolen);
							 rt_kprintf("\r\n  问题: %s \r\n",ASK_Centre.ASK_info); 
							 memset(ASK_Centre.ASK_answer,0,sizeof(ASK_Centre.ASK_answer));
							 memcpy(ASK_Centre.ASK_answer,UDP_HEX_Rx+15+ASK_Centre.ASK_infolen,infolen-2-ASK_Centre.ASK_infolen);	 

							 ASK_Centre.ASK_SdFlag=1;   // ||||||||||||||||||||||||||||||||||
							 ASK_Centre.ASK_floatID=Centre_FloatID; // 备份 FloatID	 
                                                  ASK_Centre.ASK_disp_Enable=1;
							 rt_kprintf("\r\n 提问Answer:%s\r\n",ASK_Centre.ASK_answer+3);
       
                                                  Api_RecordNum_Write(ask_quesstion,1, (u8*)&ASK_Centre,sizeof(ASK_Centre)); 	
                                                  
						  }
						   
						// if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     Ack_Resualt=0; 
						     SD_ACKflag.f_CentreCMDack_0001H=1;
					          SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;  
                                           } 

					
		              break;
           case  0x8303:    //  信息点播菜单设置
                              //--- 设置类型--
                         switch(UDP_HEX_Rx[13])
                         {
                            case 0 :  //  删除终端现有所有信息
                                      MSG_BroadCast_Init(1); 
                                      rt_kprintf("\r\n 删除信息\r\n");
                                      break;
							case 1:  // 更新菜单
									  if(UDP_HEX_Rx[13]==1)
									 	  rt_kprintf("\r\n 更新菜单\r\n");
							         //break;
							case 2:  // 追加菜单
                                       if(UDP_HEX_Rx[13]==2)
									 	  rt_kprintf("\r\n 追加菜单\r\n");
							          //break;
							case 3:  // 修改菜单
							          if(UDP_HEX_Rx[13]==3)
									 	  rt_kprintf("\r\n 修改菜单\r\n");
									  Total_ParaNum=UDP_HEX_Rx[14];           // 消息项总数
									  rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum);
									  if(Total_ParaNum!=1)
										 break;
									  //-------------------------------
									  if((UDP_HEX_Rx[15]>8)&&(UDP_HEX_Rx[15]==0))
									     MSG_BroadCast_Obj.INFO_TYPE=0;
									  else
									  	  MSG_BroadCast_Obj.INFO_TYPE=UDP_HEX_Rx[15];
									  
									  MSG_BroadCast_Obj.INFO_LEN=(UDP_HEX_Rx[16]<<8)+UDP_HEX_Rx[17];
									  memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
									  memcpy(MSG_BroadCast_Obj.INFO_STR,UDP_HEX_Rx+18,MSG_BroadCast_Obj.INFO_LEN);  
									  MSG_BroadCast_Obj.INFO_Effective=1;
									  MSG_BroadCast_Obj.INFO_PlyCancel=1;  
	                                                          Api_RecordNum_Write(msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj,sizeof(MSG_BroadCast_Obj)); 
									  rt_kprintf("\r\n 信息点播内容:%s\r\n",MSG_BroadCast_Obj.INFO_STR); 
							          break;
							default:
								      break;

                         }

                          //---------返回 -------
                          // if(SD_ACKflag.f_CentreCMDack_0001H==0) // 一般回复
 					      {
		  						 SD_ACKflag.f_CentreCMDack_0001H=1;
		  						 Ack_Resualt=0;
		  						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					       }
						   
                        /* 
                             if(SD_ACKflag.f_MsgBroadCast_0303H==0)
						 {
						     SD_ACKflag.f_MsgBroadCast_0303H=1;  
                             }
                             */ 
		              break;
		   case  0x8304:    //  信息服务
                          Ack_Resualt=0;
                          MSG_BroadCast_Obj.INFO_TYPE=UDP_HEX_Rx[13];  //  信息类型
                          MSG_BroadCast_Obj.INFO_LEN=(UDP_HEX_Rx[14]<<8)+UDP_HEX_Rx[15];
						  memset(MSG_BroadCast_Obj.INFO_STR,0,sizeof(MSG_BroadCast_Obj.INFO_STR));
						  memcpy(MSG_BroadCast_Obj.INFO_STR,UDP_HEX_Rx+16,infolen-3); 

						  MSG_BroadCast_Obj.INFO_SDFlag=1;    // ||||||||||||||||||||||||||||||||||
                           //------------------------------
						 /*  Dev_Voice.CMD_Type='2';
						   memset(Dev_Voice.Play_info,0,sizeof(Dev_Voice.Play_info));
                               memcpy(Dev_Voice.Play_info,UDP_HEX_Rx+16,infolen-3);
						   Dev_Voice.info_sdFlag=1;
						   */
						   rt_kprintf("\r\n 信息服务内容:%s\r\n",Dev_Voice.Play_info); 

                           // --------  发送给文本信息  --------------    
						   memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
						   memcpy(TextInfo.TEXT_Content,UDP_HEX_Rx+16,infolen-3);
						   TextInfo.TEXT_SD_FLAG=1;    // 置发送给显示屏标志位	// ||||||||||||||||||||||||||||||||||
						   
 
                          //------- 返回 ----
						 //  if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     Ack_Resualt=0;
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         }
		              break;	
		   case  0x8400:    //  电话回拨
                       
					   if(infolen==0)
							 break;
					   if(0==UDP_HEX_Rx[13])   // 普通通话
					   	   rt_kprintf("\r\n   电话回拨-->普通通话\r\n");
					   else
					   if(1==UDP_HEX_Rx[13])  //  监听
					       rt_kprintf("\r\n   电话回拨-->监听");
					   else
					       break;
	 					  memset(JT808Conf_struct.LISTEN_Num,0,sizeof(JT808Conf_struct.LISTEN_Num));
	 					  memcpy(JT808Conf_struct.LISTEN_Num,UDP_HEX_Rx+14,infolen-1);  										  
                                            Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
                                            CallState=CallState_rdytoDialLis;  // 准备开始拨打监听号码 

						 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=0;      
                         }
		              break;
		   case  0x8401:  //   设置电话本
                      
