nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
						 	}

                        //----------------
                    //   if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8602:    //  设置矩形区域
		               rt_kprintf("\r\n  设置矩形区域 \r\n"); 
                        if(UDP_HEX_Rx[14]==1)  //  现在支持设置一个区域
		              { 
	                       switch(UDP_HEX_Rx[13])
	                       	{	                       	      
		                          case 1:  // 追加区域
                                  case 0:  // 更新区域
		                          case 2:  // 修改区域                                      
										   memset((u8*)&Rail_Rectangle,0,sizeof(Rail_Rectangle));
                                           Rail_Rectangle.Area_ID=(UDP_HEX_Rx[15]<<24)+(UDP_HEX_Rx[16]<<16)+(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];
										   Rail_Rectangle.Area_attribute=(UDP_HEX_Rx[19]<<8)+UDP_HEX_Rx[20];
										   Rail_Rectangle.LeftUp_Latitude=(UDP_HEX_Rx[21]<<24)+(UDP_HEX_Rx[22]<<16)+(UDP_HEX_Rx[23]<<8)+UDP_HEX_Rx[24];
										   Rail_Rectangle.LeftUp_Longitude=(UDP_HEX_Rx[25]<<24)+(UDP_HEX_Rx[26]<<16)+(UDP_HEX_Rx[27]<<8)+UDP_HEX_Rx[28]; 
										   Rail_Rectangle.RightDown_Latitude=(UDP_HEX_Rx[29]<<24)+(UDP_HEX_Rx[30]<<16)+(UDP_HEX_Rx[31]<<8)+UDP_HEX_Rx[32];
										   Rail_Rectangle.RightDown_Longitude=(UDP_HEX_Rx[33]<<24)+(UDP_HEX_Rx[34]<<16)+(UDP_HEX_Rx[35]<<8)+UDP_HEX_Rx[36]; 
										   memcpy(Rail_Rectangle.StartTimeBCD,UDP_HEX_Rx+37,6);
										   memcpy(Rail_Rectangle.EndTimeBCD,UDP_HEX_Rx+43,6);   
										   Rail_Rectangle.MaxSpd=(UDP_HEX_Rx[49]<<8)+UDP_HEX_Rx[50]; 
										   Rail_Rectangle.KeepDur=UDP_HEX_Rx[51];   
										   Rail_Rectangle.Effective_flag=1;

										   if((Rail_Rectangle.Area_ID>8)||(Rail_Rectangle.Area_ID==0))
										   	Rail_Rectangle.Area_ID=1;										   
										   Api_RecordNum_Write(Rail_rect,Rail_Rectangle.Area_ID, (u8*)&Rail_Rectangle,sizeof(Rail_Rectangle)); 	 

										   rt_kprintf("\r\n   中心设置  矩形围栏 leftLati=%d leftlongi=%d\r\n",Rail_Rectangle.LeftUp_Latitude,Rail_Rectangle.LeftUp_Longitude);  
										   break;
									default:
										    break;

	                       	}    
					   
		              	} 
                        //----------------
                     //if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8603:    //  删除矩形区域
                           rt_kprintf("\r\n  删除矩形区域 \r\n");    
					   	  if(0==UDP_HEX_Rx[13])   // 区域数
                             RailRect_Init();  // 删除所有区域
						   else
						 	{						 	  
							  memset((u8*)&Rail_Rectangle,0,sizeof(Rail_Rectangle));  //  clear all  first
						 	  for(i=0;i<UDP_HEX_Rx[13];i++)
						 	  {
						 	    Rail_Rectangle.Area_ID=(UDP_HEX_Rx[14+i]<<24)+(UDP_HEX_Rx[15+i]<<16)+(UDP_HEX_Rx[16+i]<<8)+UDP_HEX_Rx[17+i];
                                if((Rail_Rectangle.Area_ID>8)||(Rail_Rectangle.Area_ID==0))
										   	Rail_Rectangle.Area_ID=1;	
								Rail_Rectangle.Effective_flag=0;
								Api_RecordNum_Write(Rail_rect,Rail_Rectangle.Area_ID, (u8*)&Rail_Rectangle,sizeof(Rail_Rectangle)); // 删除对应的围栏
						 	  }  
						 	}


                         //----------------
                     //  if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
			          break;
		   case  0x8604:	//  多边形区域
		                     rt_kprintf("\r\n  设置多边形区域 \r\n");
			                 if(UDP_HEX_Rx[14]==1)  //  现在支持设置一个区域
							 { 
								  switch(UDP_HEX_Rx[13])
								   {								 
										 case 1:  // 追加区域
										 case 0:  // 更新区域
										 case 2:  // 修改区域									   
												  memset((u8*)&Rail_Polygen,0,sizeof(Rail_Polygen));   
												  Rail_Polygen.Area_ID=(UDP_HEX_Rx[15]<<24)+(UDP_HEX_Rx[16]<<16)+(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];
												  Rail_Polygen.Area_attribute=(UDP_HEX_Rx[19]<<8)+UDP_HEX_Rx[20];
												  memcpy(Rail_Polygen.StartTimeBCD,UDP_HEX_Rx+20,6);
												  memcpy(Rail_Polygen.EndTimeBCD,UDP_HEX_Rx+26,6);   
												  Rail_Polygen.MaxSpd=(UDP_HEX_Rx[32]<<8)+UDP_HEX_Rx[33]; 
												  Rail_Polygen.KeepDur=UDP_HEX_Rx[34];   
                                                                                      Rail_Polygen.Acme_Num=UDP_HEX_Rx[35];												  
												  Rail_Polygen.Acme1_Latitude=(UDP_HEX_Rx[36]<<24)+(UDP_HEX_Rx[37]<<16)+(UDP_HEX_Rx[38]<<8)+UDP_HEX_Rx[39];
												  Rail_Polygen.Acme1_Longitude=(UDP_HEX_Rx[40]<<24)+(UDP_HEX_Rx[41]<<16)+(UDP_HEX_Rx[42]<<8)+UDP_HEX_Rx[43]; 
												  Rail_Polygen.Acme2_Latitude=(UDP_HEX_Rx[44]<<24)+(UDP_HEX_Rx[45]<<16)+(UDP_HEX_Rx[46]<<8)+UDP_HEX_Rx[47];
												  Rail_Polygen.Acme2_Longitude=(UDP_HEX_Rx[48]<<24)+(UDP_HEX_Rx[49]<<16)+(UDP_HEX_Rx[50]<<8)+UDP_HEX_Rx[51];
												  Rail_Polygen.Acme3_Latitude=(UDP_HEX_Rx[52]<<24)+(UDP_HEX_Rx[53]<<16)+(UDP_HEX_Rx[54]<<8)+UDP_HEX_Rx[55];
												  Rail_Polygen.Acme3_Longitude=(UDP_HEX_Rx[56]<<24)+(UDP_HEX_Rx[57]<<16)+(UDP_HEX_Rx[58]<<8)+UDP_HEX_Rx[59];  
			   
												  if((Rail_Polygen.Area_ID>8)||(Rail_Polygen.Area_ID==0))
												   Rail_Polygen.Area_ID=1;		
												  Rail_Polygen.Effective_flag=1;
                                                                                       Api_RecordNum_Write(Rail_polygen,Rail_Polygen.Area_ID, (u8*)&Rail_Polygen,sizeof(Rail_Polygen)); 	 
												  break;
										   default:
												   break;
			   
								   }	
							  
							   } 

                          //----------------
                      // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					     {
	 						 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					      }
		              break;
		   case  0x8605:    //  删除多边区域
                         rt_kprintf("\r\n  删除多边形区域 \r\n");
                        if(0==UDP_HEX_Rx[13])   // 区域数
                             RailPolygen_Init();  // 删除所有区域
						 else
						 	{						 	  
							  memset((u8*)&Rail_Polygen,0,sizeof(Rail_Polygen));  //  clear all  first
						 	  for(i=0;i<UDP_HEX_Rx[13];i++)
						 	  {
						 	    Rail_Polygen.Area_ID=(UDP_HEX_Rx[14+i]<<24)+(UDP_HEX_Rx[15+i]<<16)+(UDP_HEX_Rx[16+i]<<8)+UDP_HEX_Rx[17+i];
                                if((Rail_Polygen.Area_ID>8)||(Rail_Polygen.Area_ID==0))
										   	Rail_Polygen.Area_ID=1;	
								Rail_Polygen.Effective_flag=0;   
                                                         Api_RecordNum_Write(Rail_polygen,Rail_Polygen.Area_ID, (u8*)&Rail_Polygen,sizeof(Rail_Polygen)); 	 
						 	  }   
						 	}

                          //----------------
                      // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 } 
		              break;
		   case  0x8606:    //  设置路线
		                 rt_kprintf("\r\n  设置路线 \r\n");
						memset((u8*)&ROUTE_Obj,0,sizeof(ROUTE_Obj));  //  clear all  first			
                                          ROUTE_Obj.Route_ID=(UDP_HEX_Rx[13]<<24)+(UDP_HEX_Rx[14]<<16)+(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16];  
 						ROUTE_Obj.Route_attribute=(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];  						
						memcpy(ROUTE_Obj.StartTimeBCD,UDP_HEX_Rx+19,6); 
						memcpy(ROUTE_Obj.EndTimeBCD,UDP_HEX_Rx+25,6); 
						ROUTE_Obj.Points_Num=(UDP_HEX_Rx[31]<<8)+UDP_HEX_Rx[32];  
						rt_kprintf("\r\n ROUTE_Obj.ID:  %d  \r\n ",ROUTE_Obj.Route_ID);    
						rt_kprintf("\r\n ROUTE_Obj.ID:  %04X  \r\n ",ROUTE_Obj.Route_attribute); 
						rt_kprintf("\r\n ROUTE_Obj.Points_Num:  %d  \r\n ",ROUTE_Obj.Points_Num);   
						if(ROUTE_Obj.Points_Num<3) 
						{ 
 						   SD_ACKflag.f_CentreCMDack_0001H=1;
 						   Ack_Resualt=0;
 						    SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
						  break;
						}  
						reg_u32=33;
						for(i=0;i<6;i++)  // 拐点数目
						{						  
						   // if((infolen+32)<reg_u32)   
							//	 break;   
							   
