nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
						  ROUTE_Obj.RoutePoints[i].POINT_ID=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
						  rt_kprintf("\r\n PointID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_ID);
						  ROUTE_Obj.RoutePoints[i].Line_ID=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                            rt_kprintf("\r\n LineID=%08x\r\n",ROUTE_Obj.RoutePoints[i].Line_ID);
						  ROUTE_Obj.RoutePoints[i].POINT_Latitude=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                             rt_kprintf("\r\n LatiID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_Latitude); 
						  ROUTE_Obj.RoutePoints[i].POINT_Longitude=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                                rt_kprintf("\r\n LongID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_Longitude); 
						  ROUTE_Obj.RoutePoints[i].Width=UDP_HEX_Rx[reg_u32++];  
						     rt_kprintf("\r\n Width=%02x\r\n",ROUTE_Obj.RoutePoints[i].Width); 
						  ROUTE_Obj.RoutePoints[i].Atribute=UDP_HEX_Rx[reg_u32++]; 
						   rt_kprintf("\r\n atrit=%02x\r\n\r\n",ROUTE_Obj.RoutePoints[i].Atribute);         
						   if(ROUTE_Obj.RoutePoints[i].Atribute==0)
                                                            ;
						   else
						    if(ROUTE_Obj.RoutePoints[i].Atribute==1) 
                                                      ROUTE_Obj.RoutePoints[i].MaxSpd=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
                                             else
							 { 
									  ROUTE_Obj.RoutePoints[i].TooLongValue=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
									  ROUTE_Obj.RoutePoints[i].TooLessValue=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++];   
									  ROUTE_Obj.RoutePoints[i].MaxSpd=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
									  ROUTE_Obj.RoutePoints[i].KeepDur=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++];    
						     	}

						}	
                           
						  if((ROUTE_Obj.Route_ID>Route_Mum)||(ROUTE_Obj.Route_ID==0))
									  ROUTE_Obj.Route_ID=1;		
						  ROUTE_Obj.Effective_flag=1;
						  Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj));// 删除对应的围栏 



                           //----------------
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8607:    //  删除路线
                         rt_kprintf("\r\n  删除路线 \r\n");  
                         if(0==UDP_HEX_Rx[13])   // 区域数
                             RouteLine_Init();  // 删除所有区域
						 else
						 	{						 	  
							  memset((u8*)&ROUTE_Obj,0,sizeof(ROUTE_Obj));  //  clear all  first
						 	  for(i=0;i<UDP_HEX_Rx[13];i++)
						 	  {
						 	    ROUTE_Obj.Route_ID=(UDP_HEX_Rx[14+i]<<24)+(UDP_HEX_Rx[15+i]<<16)+(UDP_HEX_Rx[16+i]<<8)+UDP_HEX_Rx[17+i];
                                if((ROUTE_Obj.Route_ID>Route_Mum)||(ROUTE_Obj.Route_ID==0))
										   	ROUTE_Obj.Route_ID=1;	
								ROUTE_Obj.Effective_flag=0;       
								     Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj)); 	  // 删除对应的围栏
						 	  }   
						 	}  

                           //----------------
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;        
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
           case  0x8700:    //  行车记录仪数据采集命令
                    			 /*
															 行车记录仪发送出发开始
								   */
								  rt_kprintf( "\r\n  记录仪采集命令 \r\n" );
								  Recode_Obj.Float_ID = Centre_FloatID;

                                  /*
                                                             exam1  gghypt: 7E 87 00 00 15 01 39 01 23 45 03 01 A1 09 AA 75 09 00 0E 00 13 01 01 01 01 01 14 01 01 01 01 01 0A  D5 67 7E
                                                             exam2   cctic:   7E 87 00 00 01 01 36 01 30 00 01 C9 47 15 1A 7E
                                                            */

								   //------ 判断有没有起始时间 -----------
								   Recode_Obj.Get_withDateFlag=0;   // 初始化没有 GB19056 报文 
                                  if((UDP_HEX_Rx[14]==0xAA)&&(UDP_HEX_Rx[15]==0x75)&&(UDP_HEX_Rx[13]==UDP_HEX_Rx[16])) 
                                  {   // 判断该字段是否有 GB19056 2012 的字段内容  ，协议里写可为空，
                                      // 然后判断中心下发的命令字和GB19056 里的命令字是否一致
                                      GB19056infolen=(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];
									  if(GB19056infolen==0x0E)   // 长度是14  
									  switch(UDP_HEX_Rx[16])
									  	{  // 判断ID 是否是  08 -15 
									  	    case 0x08:
										    case 0x09:
										    case 0x10:
										    case 0x11:
										    case 0x12:
										    case 0x13:
										    case 0x14:
										    case 0x15: 	  
												for(i=0;i<6;i++)
													{
										  	            Recode_Obj.Get_startDate[i]=UDP_HEX_Rx[20+i];  
														Recode_Obj.Get_endDate[i]=UDP_HEX_Rx[26+i];  

													}
											  Recode_Obj.Get_recNum=(UDP_HEX_Rx[31]<<8)+UDP_HEX_Rx[32];  // 获取的条数
											  Recode_Obj.Get_withDateFlag= 1; 

                                                      // ---  记录仪获取采集指定日志时间-- 
											     if(UDP_HEX_Rx[16]==0x15)
															VDR_get_15H_StartEnd_Time(UDP_HEX_Rx+20,UDP_HEX_Rx+26);
							

											  rt_kprintf( "\r\n  记录仪8700 带AA 75 start   %2X-%2X-%2X  %2X:%2X:%2X\r\n",UDP_HEX_Rx[20],UDP_HEX_Rx[21],UDP_HEX_Rx[22],UDP_HEX_Rx[23],UDP_HEX_Rx[24],UDP_HEX_Rx[25]);
											  rt_kprintf( "\r\n                     end     %2X-%2X-%2X  %2X:%2X:%2X  GetNUM: %d \r\n",UDP_HEX_Rx[26],UDP_HEX_Rx[27],UDP_HEX_Rx[28],UDP_HEX_Rx[29],UDP_HEX_Rx[30],UDP_HEX_Rx[31],Recode_Obj.Get_recNum); 
											  break;
										   default:
                                                      Recode_Obj.Get_withDateFlag=0;
											          break;
										}
                                         


								  
