nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                                  }
								  
								  //Recode_Obj.CMD=UDP_HEX_Rx[13];   
								  //	Stuff  Hardly
								  switch( UDP_HEX_Rx[13] )
								  {
									  case 0x00:
									  case 0x01:
									  case 0x02:
									  case 0x03:	
									  case 0x04:
									  case 0x05:
									  case 0x06:
									  case 0x07:	
									  case 0x08:
									  case 0x09:
									  case 0x10:
									  case 0x11:
									  case 0x12:
									  case 0x13:
									  case 0x14:
									  case 0x15: 	  
									  	  Recode_Obj.CMD   = UDP_HEX_Rx[13]; 
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1; 
										  break;
									  //--------- Lagre  block -------
								  
								  
									  /*
									        cmd 		maxnum
									        15H	       2
									        12H 	10
										 11H 	10
										 10H  	100
										 09H 	360
										 08H 	576								  
									   */
									/*  case	0x08:  Recode_Obj.Total_pkt_num   = 20;//720;
										  Recode_Obj.Current_pkt_num		  = 1;
										  Recode_Obj.Devide_Flag			  = 1;
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  MediaObj.Media_Type	  = 3; //行驶记录仪
										  break;
								  
									  case	0x09:  Recode_Obj.Total_pkt_num   =15; // 720;
										  Recode_Obj.Current_pkt_num		  = 0; //0
										  Recode_Obj.Devide_Flag			  = 1;
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  MediaObj.Media_Type	  = 3; //行驶记录仪
										  break;
									  case	0x10:
										  Recode_Obj.Total_pkt_num	  =10;// 100;
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type	  = 3; //行驶记录仪
										  break;
									  case	0x11:
										  Recode_Obj.Total_pkt_num	  = 10;//100;
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  Recode_Obj.CMD			  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag	  = 1;
										  Recode_Obj.CountStep		  = 1;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type		  = 3; //行驶记录仪
										  break;
									  case	0x12:
										  Recode_Obj.Total_pkt_num	  = 10;
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  Recode_Obj.CMD			  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag	  = 1;
										  Recode_Obj.CountStep		  = 1;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type		  = 3; //行驶记录仪
										  break;
									  case	0x13:
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  break;
									  case	0x14:
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  break;
									  case	0x15:
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  Recode_Obj.CMD			  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag	  = 1;
										  Recode_Obj.CountStep		  = 1;
										  Recode_Obj.Total_pkt_num	  = 2;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type		  = 3;						  //行驶记录仪
										  break;*/
									   default:
									   	      Recode_Obj.Error=1;  //  采集错误
												  break;
										 }
		              break;
		   case  0x8701:    //  行驶记录仪参数下传命令
		               rt_kprintf("\r\n  记录仪参数下传 \r\n");
		               Recode_Obj.Float_ID=Centre_FloatID;
					   Recode_Obj.CMD=UDP_HEX_Rx[13];    
					   Recode_Obj.SD_Data_Flag=1;  
					   CenterSet_subService_8701H(Recode_Obj.CMD,UDP_HEX_Rx+14); //跳过2B长度和1 保留字
			          break; 
		   case  0x8800:    //   多媒体数据上传应答
		              if(infolen==5)
		              	{  //  判断是否有重传ID列表，如果没有则表示中心接收完成!						
                                switch (MediaObj.Media_Type)
						         {
						          case 0 : // 图像
						                  Photo_send_end();  // 拍照上传结束
						                  rt_kprintf("\r\n 图像传输结束! \r\n");
                                          //------------多路拍照处理  -------
                                         // CheckResualt=Check_MultiTakeResult_b4Trans();  
						                 				   
								          break;
								  case 1 : // 音频
								          Sound_send_end();
										  rt_kprintf("\r\n 音频传输结束! \r\n");
								          break;
								  case 2 : // 视频
									      Video_send_end();
  								          rt_kprintf("\r\n 视频传输结束! \r\n");  
								          break;
								  default:
								  	      break;
						         }
						// if(CheckResualt==0)	
						   	   Media_Clear_State(); 
		              	}
					  else
					  	{  //  重传包ID 列表 
					  	  if(UDP_HEX_Rx[17]!=0)
					  	  {
						  	   MediaObj.RSD_State=1;   //   进入重传状态
						  	   MediaObj.RSD_Timer=0;   //   清除重传定时器   
						  	   MediaObj.RSD_Reader=0;
							   MediaObj.RSD_total=UDP_HEX_Rx[17];    // 重传包总数
						  	   memset(MediaObj.Media_ReSdList,0,125);
							   memcpy(MediaObj.Media_ReSdList,UDP_HEX_Rx+18,UDP_HEX_Rx[17]); 
	                            rt_kprintf("\r\n  重传列表: ");
							   for(i=0;i<MediaObj.RSD_total;i++)
							     rt_kprintf(" %d",UDP_HEX_Rx[18+i]); 
							   rt_kprintf("\r\n"); 
					  	   } 
						}
                        
		              break;
		   case  0x8801:   //    摄像头立即拍照		  

				     Camera_Obj.Channel_ID=UDP_HEX_Rx[13];     //   通道
					 Camera_Obj.Operate_state=UDP_HEX_Rx[18];  //   是否保存标志位  
		            //----------------------------------
				   
