nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					  //--------- 送给小屏幕---------- 	
					  	memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
						AsciiToGb(TextInfo.TEXT_Content,infolen-1,UDP_HEX_Rx+14); 
						TextInfo.TEXT_SD_FLAG=1;	// 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||

						//========================================
						   

						     #ifdef LCD_5inch
						 
							 DwinLCD.Type=LCD_SDTXT;
							  memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);  						  
				   
							#endif  
					 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		   	        }
				 else
				 {
                                   if(UDP_HEX_Rx[13]==0x1F) 
					  	{
					  	 
						    //ISP_Get_RawData(UDP_HEX_Rx+14,UDP_hexRx_len-14); 	
						    rt_kprintf("\r\n ISP_raw\r\n"); 
					           Nullpro_8900H (UDP_HEX_Rx+14);
						    return;	
					  	  //  DataTrans_ISPService_8900H(UDP_HEX_Rx+14); //14 偏移是信息内容
					  	}
					  else
					  	{
					  	rt_kprintf("\r\n透传数据类型错误UDP_HEX_Rx[13]=%d",UDP_HEX_Rx[13]);
					  	}
				 }
		              break;
		   case  0x8A00:   //    平台RSA公钥

		   
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0) 
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 } 
				      break;	
		  //----------     北斗相关扩展协议   ----------------------			  
		  case   0xFF01:   // 扩展终端参数设置
                                       if(contentlen)
                                      {                       // 和中心商议好了每次只下发操作一项设置
                                          Total_ParaNum=UDP_HEX_Rx[13]; // 中心设置参数总数
                                          rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum);
						 //------------------------------------------------------------------- 
						 ContentRdAdd=14;
						 Process_Resualt=0;  // clear resualt
						 for(i=0;i<Total_ParaNum;i++)
						 {
						   //  数类型是DWORD 4 个字节
						   SubCMD_FF01H=(UDP_HEX_Rx[ContentRdAdd]<<24)+(UDP_HEX_Rx[ContentRdAdd+1]<<16)+(UDP_HEX_Rx[ContentRdAdd+2]<<8)+UDP_HEX_Rx[ContentRdAdd+3]; 
                                            //  子信息长度
						   SubInfolen=UDP_HEX_Rx[ContentRdAdd+4];
						   //  处理子信息 如果设置成功把相应Bit 位置为 1 否则保持 0
						   if(CentreSet_subService_FF01H(SubCMD_FF01H,SubInfolen,UDP_HEX_Rx+ContentRdAdd+5))
                                              Process_Resualt|=(0x01<<i);						   
						   //  移动偏移地址
						   ContentRdAdd+=5+UDP_HEX_Rx[ContentRdAdd+4]; // 偏移下标 
						 } 						   
						 Ack_Resualt=0;
                                        }	
                                          BD_EXT_Write();   
					  
                                   {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }    
		                   break;
		  case   0xFF02: // 扩展终端参数查询
                                  SD_ACKflag.f_BD_Extend_7F02H=1;
				      rt_kprintf("\r\n  中心查询北斗相关设置信息\r\n");			  
		                   break;
		  case  0xFF03:   //  扩展终端参数设置1 命令
                                   
                                    if(contentlen)
                                      {                       // 和中心商议好了每次只下发操作一项设置
                                          Total_ParaNum=UDP_HEX_Rx[13]; // 中心设置参数总数
                                          rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum);
						 //------------------------------------------------------------------- 
						 ContentRdAdd=14;
						 Process_Resualt=0;  // clear resualt
						 for(i=0;i<Total_ParaNum;i++)
						 {
						   //  数类型是DWORD 4 个字节
						   SubCMD_FF03H=(UDP_HEX_Rx[ContentRdAdd]<<24)+(UDP_HEX_Rx[ContentRdAdd+1]<<16)+(UDP_HEX_Rx[ContentRdAdd+2]<<8)+UDP_HEX_Rx[ContentRdAdd+3]; 
                                            //  子信息长度
						   SubInfolen=UDP_HEX_Rx[ContentRdAdd+4];
						   //  处理子信息 如果设置成功把相应Bit 位置为 1 否则保持 0
						   if(CentreSet_subService_FF03H(SubCMD_FF03H,SubInfolen,UDP_HEX_Rx+ContentRdAdd+5))
                                              Process_Resualt|=(0x01<<i);						   
						   //  移动偏移地址
						   ContentRdAdd+=5+UDP_HEX_Rx[ContentRdAdd+4]; // 偏移下标 
						 } 						   
						 Ack_Resualt=0;
                                        }	


                                  {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 } 
			            break;
		    default:
				      break;  	    
	    } 

		//-----------------  memset  ------------------------------------- 
		//memset(UDP_HEX_Rx, 0, sizeof(UDP_HEX_Rx));	
		//UDP_hexRx_len= 0; 
        return;  

}


void Time2BCD(u8 *dest)
 {
	dest[0]=((time_now.year/10)<<4)+(time_now.year%10);  	   	
	dest[1]=((time_now.month/10)<<4)+(time_now.month%10); 
	dest[2]=((time_now.day/10)<<4)+(time_now.day%10);
	dest[3]=((time_now.hour/10)<<4)+(time_now.hour%10);
	dest[4]=((time_now.min/10)<<4)+(time_now.min%10);
	dest[5]=((time_now.sec/10)<<4)+(time_now.sec%10);     
	
 }

void AvrgSpd_MintProcess(u8 hour,u8 min, u8 sec)  
{
	   //------- 系统启动时处理   若 标志位为0 且年月日都为 0，表面是系统刚刚启动，这时获取当前时间把当前时间给BAK------
	if((0==Avrgspd_Mint.saveFlag)&&(Avrgspd_Mint.datetime_Bak[0]==0)&&(Avrgspd_Mint.datetime_Bak[1]==0)&&(Avrgspd_Mint.datetime_Bak[2]==0))
		{
		Time2BCD(Avrgspd_Mint.datetime);  
		memcpy(Avrgspd_Mint.datetime_Bak,Avrgspd_Mint.datetime,6);//将当前时间给BAK
		avgspd_Mint_Wr=Temp_Gps_Gprs.Time[1];//time_now.min;
		//rt_kprintf("\r\n-------------()avgspd_Mint_Wr=%d",avgspd_Mint_Wr);
		}	
	else
		{     // 若不是系统启动开始   
		if(min==0) //  把秒数写为非0 ，以便留出时间去存储上1小时的数据 
			{
			if(sec==5)  //存储上一小时每分钟的平均速度 ==2是因为要保证第59分钟速度已经被存储到相应的寄存器中
				{
				memcpy(Avrgspd_Mint.datetime_Bak,Avrgspd_Mint.datetime,6);//将当前时间给BAK
				Avrgspd_Mint.datetime_Bak[4]=0;// 分钟为0
				Avrgspd_Mint.datetime_Bak[5]=0;// 秒也为0 
				Avrgspd_Mint.saveFlag=1;//使能存储      到NandFlag  标志位
				Time2BCD(Avrgspd_Mint.datetime);//获取新的时间
				//rt_kprintf("\r\n存储前一小时平均速度,min=%d",min);
				} 
			if(sec==8)    //存储完后  清除时间下标  
				avgspd_Mint_Wr=0;
			}
		}
	
	if(sec==0)  // 秒为0时存储上1分钟的数据
		{
		//rt_kprintf("\r\n下一分钟开始,PerMinSpdTotal=%d,AspdCounter=%d",PerMinSpdTotal,AspdCounter);
		if(AspdCounter)
			{			
			Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=PerMinSpdTotal/AspdCounter;//第几分钟的平均速度			
			//---rt_kprintf("\r\n--------------stuff spd=%d PerMinSpdTotal=%d,AspdCounter=%d",Avrgspd_Mint.avgrspd[avgspd_Mint_Wr], PerMinSpdTotal,AspdCounter);  
			//=============================================================
			//为了好测试暂时把1分钟内速度总和当作平均速度来统计
			//Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=PerMinSpdTotal;
			//=============================================================
			}
		else
			{
			Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=0; 
			//rt_kprintf("\r\n-------------(速度无效)");
			}
		//rt_kprintf("\r\n--------------%d分,平均速度=%d \r\n", avgspd_Mint_Wr,Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]);  
		//avgspd_Mint_Wr++;//=(Avrgspd_Mint.datetime[4]>>4)*10+(0x0f&Avrgspd_Mint.datetime[4]);  
		
		PerMinSpdTotal=0;  // clear   
		AspdCounter=0;	   // clear  
		
		//rt_kprintf("\r\n清0，速度总和=%d,次数=%d\r\n",PerMinSpdTotal,AspdCounter);
		
