nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

  void Spd_Exp_Wr(void)
  {	
     u8  content[40];
     u8  wr_add=0,i=0,FCS=0; 	 

	 memset(content,0,sizeof(content));
	memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
	wr_add+=18;
	memcpy(content+wr_add,speed_Exd.ex_startTime,6);
	wr_add+=6;
	memcpy(content+wr_add,speed_Exd.ex_endTime,6);  
	wr_add+=6; 
	content[wr_add++]=speed_Exd.current_maxSpd/10; 

       FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(spd_warn, (u8 *)content, 32); 
	  //----------- debug -----------------------
	  rt_kprintf("\r\n 超速报警  %X-%X-%X %X:%X:%X,MaxSpd=%d\r\n",speed_Exd.ex_endTime[0],speed_Exd.ex_endTime[1],speed_Exd.ex_endTime[2],speed_Exd.ex_endTime[3],speed_Exd.ex_endTime[4],speed_Exd.ex_endTime[5],speed_Exd.current_maxSpd); 
     //--------- clear status ----------------------------
     Spd_ExpInit(); 

  }

void Save_TiredDrive_Record(void)
{
  u8   content[40];
  u8   wr_add=0,FCS=0,i; 

        wr_add=0; 
	 memset(content,0,70);

	  Time2BCD(TiredConf_struct.Tired_drive.end_time); 
	 
         memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
	  wr_add+=18;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.start_time,6);
	  wr_add+=6;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.end_time,6);
	  wr_add+=6; 

	      FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(tired_warn, (u8 *)content, 32); 
       //-----  clear status ---------------  
	  TIRED_Drive_Init();      
	  Status_TiredwhRst=0;
	 // DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入		
	   TIRED_Drive_Init(); //	休息了 
	   Warn_Status[3]&=~0x04;  //BIT(2)	疲劳驾驶  

}


void  JT808_Related_Save_Process(void)
{
       if(DF_LOCK)
	   	 return ;

	  if(Dev_Voice.CMD_Type!='1')  // 录音时不做以下处理  
      {           
        // 1. VDR  08H  Data  Save          
         if(VdrData.H_08_saveFlag==1)
         {   
             OutPrint_HEX("08H save",VdrData.H_08_BAK,126);   
             vdr_creat_08h(Vdr_Wr_Rd_Offset.V_08H_Write,VdrData.H_08_BAK,126); 		
			 Vdr_Wr_Rd_Offset.V_08H_Write++; //  写完之后累加，就不用遍历了
             VdrData.H_08_saveFlag=0;   
         }
	    // 2.  VDR  09H  Data  Save 
	     if(VdrData.H_09_saveFlag==1)
         {    
             OutPrint_HEX("09H save",VdrData.H_09,666);  
             vdr_creat_09h(Vdr_Wr_Rd_Offset.V_09H_Write,VdrData.H_09,666); 	
			 Vdr_Wr_Rd_Offset.V_09H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_09_saveFlag=0;   
         }
       //  3. VDR  10H  Data  Save
         if(VdrData.H_10_saveFlag==1)
         {   
             OutPrint_HEX("10H save",VdrData.H_10,234);   
             vdr_creat_10h(Vdr_Wr_Rd_Offset.V_10H_Write,VdrData.H_10,234); 	
			 Vdr_Wr_Rd_Offset.V_10H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_10_saveFlag=0;
         }
      //  4.  VDR  11H  Data  Save
          if(VdrData.H_11_saveFlag==1)
         {     
             OutPrint_HEX("11H save",VdrData.H_11,50);   
             vdr_creat_11h(Vdr_Wr_Rd_Offset.V_11H_Write,VdrData.H_11,50); 	
			 Vdr_Wr_Rd_Offset.V_11H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_11_saveFlag=0;
         } 
	  //  5.  VDR  12H  Data  Save
          if(VdrData.H_12_saveFlag==1)
         {     
             OutPrint_HEX("12H save",VdrData.H_12,25);  
             vdr_creat_12h(Vdr_Wr_Rd_Offset.V_12H_Write,VdrData.H_12,25); 	
			 Vdr_Wr_Rd_Offset.V_12H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_12_saveFlag=0;
			 
			 rt_kprintf("\r\n 写IC 卡  记录  \r\n");   
         }  	 
      //  6.  VDR  13H  Data  Save
          if(VdrData.H_13_saveFlag==1)
         {  
             OutPrint_HEX("13H save",VdrData.H_13,7);  
             vdr_creat_13h(Vdr_Wr_Rd_Offset.V_13H_Write,VdrData.H_13,7); 	
			 Vdr_Wr_Rd_Offset.V_13H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_13_saveFlag=0;
         } 
      //  7.  VDR  14H  Data  Save
          if(VdrData.H_14_saveFlag==1)
         {    
              OutPrint_HEX("14H save",VdrData.H_14,7);  
             vdr_creat_14h(Vdr_Wr_Rd_Offset.V_14H_Write,VdrData.H_14,7); 	
			 Vdr_Wr_Rd_Offset.V_14H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_14_saveFlag=0;
         } 		  
 
		 
		//---------------------------------------
	    //  存储每分钟速度信息  
		if(1==Avrgspd_Mint.saveFlag) 
		{
			Save_AvrgSpdPerMin();
			Avrgspd_Mint.saveFlag=0; 
			return;
		}							  	  

		//-----------------  存储疲劳驾驶记录 ---------------			
		if( TiredConf_struct.Tired_drive.Tireddrv_status==2)   
		{
	             Save_TiredDrive_Record();
			return;	 
		}			
		//-----------------  超速报警 ----------------------
		if(speed_Exd.excd_status==2)
		{
		   Spd_Exp_Wr();   
		   return;
		}   

     }           
	//	 定时存储里程
	if((Vehicle_RunStatus)&&((Systerm_Reset_counter&0xff)==0xff))
	{   //  如果车辆在行驶过程中，每255 秒存储一次里程数据    
                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
		  return;		
	} 
			
	 //--------------------------------------------------------------

}

/*
    打印输出 HEX 信息，Descrip : 描述信息 ，instr :打印信息， inlen: 打印长度
*/
void OutPrint_HEX(u8 * Descrip, u8 *instr, u16 inlen )
{
    u32  i=0;
     rt_kprintf("\r\n %s:",Descrip);
     for( i=0;i<inlen;i++)
          rt_kprintf("%2X ",instr[i]); 
     rt_kprintf("\r\n");
}

/*
void gpsspd(u8 *strin)   //  GPS 用假速度
{
   sscanf(strin, "%d", (u32*)&Spd_add_debug);
   rt_kprintf("\r\n set gpsspd= %d s\r\n",Spd_add_debug);  
}
FINSH_FUNCTION_EXPORT(gpsspd, gpsspd);    

void normalspd(void)    // 恢复 GPS 用真速度
{
    Spd_add_debug=0;
    rt_kprintf("\r\n recover normal spd\r\n");   
}
FINSH_FUNCTION_EXPORT(normalspd, normalspd);     
*/
void  dur(u8 *content)
{
  sscanf(content, "%d", (u32*)&Current_SD_Duration);
  rt_kprintf("\r\n 手动设置上报时间间隔 %d s\r\n",Current_SD_Duration); 
  
       JT808Conf_struct.DURATION.Default_Dur=Current_SD_Duration;
        Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
}
FINSH_FUNCTION_EXPORT(dur, dur);  



