nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
void handsms(u8 *instr)
{    
    memset(SMS_Service.SMS_sd_Content,0,sizeof(SMS_Service.SMS_sd_Content)); 
    memcpy(SMS_Service.SMS_sd_Content,instr,strlen(instr));  
    SMS_Service.SMS_sendFlag=1;	
	SMS_Service.SMS_come=1;
    rt_kprintf("手动发送:  %s",SMS_Service.SMS_sd_Content);    
}
FINSH_FUNCTION_EXPORT(handsms, handsms);  


void driver_name(u8 *instr)
{   
    memset(JT808Conf_struct.Driver_Info.DriveName,0,sizeof(JT808Conf_struct.Driver_Info.DriveName)); 
	memcpy(JT808Conf_struct.Driver_Info.DriveName,instr,strlen(instr)); 
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));		
}
FINSH_FUNCTION_EXPORT(driver_name, set_driver_name );   



void chepai(u8 *instr)
{    
    memset(JT808Conf_struct.Vechicle_Info.Vech_Num,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Num));
    memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,instr,8); 
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));  
}
FINSH_FUNCTION_EXPORT(chepai, set_chepai);   

void  vin_set(u8 *instr)
{
	 //车辆VIN
	memset(JT808Conf_struct.Vechicle_Info.Vech_VIN,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_VIN));
	memcpy(JT808Conf_struct.Vechicle_Info.Vech_VIN,instr,strlen(instr)); 
	Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
       rt_kprintf("\r\n 手动设置vin:%s \r\n",instr); 

}
FINSH_FUNCTION_EXPORT(vin_set, vin_set );    

void  current(void)
{
    PositionSD_Enable();
    Current_UDP_sd=1;

}
FINSH_FUNCTION_EXPORT(current, current );    


void  link_mode(u8 *instr)
{
   if(instr[0]=='1')
   {
      JT808Conf_struct.Link_Frist_Mode=1;
	   rt_kprintf("\r\n Mainlink:%s \r\n",instr); 
   }	  
   else
   if(instr[0]=='0')
   {
   	   JT808Conf_struct.Link_Frist_Mode=0;
       rt_kprintf("\r\n DNSR :%s \r\n",instr);  
   }

  
   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));	 

}
FINSH_FUNCTION_EXPORT(link_mode, link_mode );    

void  redial(void)
{
      DataLink_EndFlag=1; //AT_End();   
        rt_kprintf("\r\n Redial\r\n");      
}
FINSH_FUNCTION_EXPORT(redial, redial);

void  port(u8 *instr)
{
   		   sscanf(instr, "%d", (u32*)&RemotePort_main);  
		   rt_kprintf("\r\n设置主端口=%d!",RemotePort_main);
		   SysConf_struct.Port_main=RemotePort_main;
		   Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
		   
		   DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
			DataLink_EndFlag=1; //AT_End();  

}
FINSH_FUNCTION_EXPORT(port, port); 



// C.  Module
